{
  "items": [
    {
      "slug": "seoul-subway",
      "displayName": "Seoul Subway",
      "summary": "Seoul Subway assistant for real-time arrivals, route planning, and service alerts (Korean/English)",
      "tags": {
        "latest": "0.1.8"
      },
      "stats": {
        "comments": 0,
        "downloads": 23,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 9
      },
      "createdAt": 1769620258273,
      "updatedAt": 1769872135016,
      "latestVersion": {
        "version": "0.1.8",
        "createdAt": 1769872135016,
        "changelog": "- Added model specification (`model: sonnet`) to skill metadata.\n- No changes to functionality or user experience.\n- Documentation updated only."
      }
    },
    {
      "slug": "opensoul",
      "displayName": "OpenSoul - An immutable, private soul for agent Self-reflection, self-improvement and on-chain economic activities.",
      "summary": null,
      "tags": {
        "PGP": "1.0.0",
        "blockchain": "1.0.0",
        "latest": "1.0.0",
        "logging": "1.0.0",
        "microtransactions": "1.0.0",
        "persistent memory": "1.0.0",
        "public": "1.0.0",
        "soul": "1.0.0",
        "untested": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 0,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871834754,
      "updatedAt": 1769871834754,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769871834754,
        "changelog": "OpenSoul 1.0.0 initial release\n\n- Introduces an auditable agent identity with transparent structured JSON logging of actions, metrics, and reflections.\n- Supports session-based batching and persistent log storage, with tools for log analysis and self-reflection to optimize behavior.\n- Provides privacy and on-chain logging options via BSV integration (optional with environment variable).\n- Includes setup instructions and example commands for both basic and advanced OpenSoul features.\n- Defines standardized log format and actionable reflection guidelines for session oversight and improvement."
      }
    },
    {
      "slug": "agentpixels-skill",
      "displayName": "AgentPixels.art AI Agent Collaborative Art",
      "summary": "AI Agent Collaborative Art Platform - 512x512 shared canvas",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 5,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769869021066,
      "updatedAt": 1769871819354,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769869021066,
        "changelog": "AgentPixels 1.0.0 ÔÇô Initial release\n\n- Launch of AgentPixels, a collaborative AI agent art platform on a 512x512 shared canvas.\n- Introduces full API for agent registration, pixel drawing, chat, and canvas state.\n- Includes security and rate limit guidance for agent developers.\n- Supports LLM-friendly canvas summaries and real-time WebSocket updates.\n- Provides example code and strategic agent interaction tips."
      }
    },
    {
      "slug": "clerk-auth",
      "displayName": "Clerk Auth",
      "summary": "Clerk auth with API Keys beta (Dec 2025), Next.js 16 proxy.ts (March 2025 CVE context), API version 2025-11-10 breaking changes, clerkMiddleware() options, webhooks, production considerations (GCP outages), and component reference. Prevents 15 documented errors. Use when: API keys for users/orgs, Next.js 16 middleware filename, troubleshooting JWKS/CSRF/JWT/token-type-mismatch errors, webhook verification, user type inconsistencies, or testing with 424242 OTP.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 2,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871343181,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871343181,
        "changelog": "- Initial public release with comprehensive guide for Clerk authentication.\n- Introduces API Keys beta (Dec 2025) supporting user/org-scoped API keys, with CRUD UI component and backend verification patterns.\n- Details breaking changes for Next.js 16: new proxy.ts middleware filename (replacing middleware.ts) due to March 2025 CVE; Clerk v6.35.0+ required.\n- Covers API version 2025-11-10 breaking changes (Nov 2025) impacting billing endpoints, field terminology, and response structure.\n- Documents new features: force password reset, organization analytics filters, PKCE for custom OAuth, and automatic credential stuffing defense.\n- Includes updated error prevention, webhook verification, and best practices for production setups and middleware configuration."
      }
    },
    {
      "slug": "claude-agent-sdk",
      "displayName": "Claude Agent Sdk",
      "summary": "Build autonomous AI agents with Claude Agent SDK. Structured outputs guarantee JSON schema validation, with plugins system and hooks for event-driven workflows. Prevents 14 documented errors.\n\nUse when: building coding agents, SRE systems, security auditors, or troubleshooting CLI not found, structured output validation, session forking errors, MCP config issues, subagent cleanup.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 4,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871306699,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871306699,
        "changelog": "claude-agent-sdk v0.1.0\n\n- Initial release of Claude Agent SDK for building autonomous AI agents.\n- Supports structured JSON output with schema validation.\n- Introduces plugins system for extensibility.\n- Hooks system enables event-driven workflows.\n- Prevents 14 documented errors related to coding, SRE, security, and troubleshooting."
      }
    },
    {
      "slug": "azure-auth",
      "displayName": "Azure Auth",
      "summary": "Microsoft Entra ID (Azure AD) authentication for React SPAs with MSAL.js and Cloudflare Workers JWT validation using jose library. Full-stack pattern with Authorization Code Flow + PKCE. Prevents 8 documented errors.\n\nUse when: implementing Microsoft SSO, troubleshooting AADSTS50058 loops, AADSTS700084 refresh token errors, React Router redirects, setActiveAccount re-render issues, or validating Entra ID tokens in Workers.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 2,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871275836,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871275836,
        "changelog": "azure-auth 0.1.0\n\n- Initial release providing Microsoft Entra ID (Azure AD) authentication for React SPAs and JWT validation in Cloudflare Workers.\n- Implements Authorization Code Flow with PKCE using @azure/msal-react v5 and the jose library (Cloudflare Workers compatible).\n- Offers mitigation guidance for 8 common MSAL/Azure AD errors, including SSO issues and token refresh problems.\n- Includes quick-start setup for both frontend (React) and backend (Cloudflare Workers).\n- Documents key breaking changes: MSAL v4ÔåÆv5 migration, Azure AD B2C and ADAL retirements.\n- Provides step-by-step configuration, recommended patterns, and architecture overview."
      }
    },
    {
      "slug": "better-auth",
      "displayName": "Better Auth",
      "summary": "Self-hosted auth for TypeScript/Cloudflare Workers with social auth, 2FA, passkeys, organizations, RBAC, and 15+ plugins. Requires Drizzle ORM or Kysely for D1 (no direct adapter). Self-hosted alternative to Clerk/Auth.js.\n\nUse when: self-hosting auth on D1, building OAuth provider, multi-tenant SaaS, or troubleshooting D1 adapter errors, session caching, rate limits, Expo crashes, additionalFields bugs.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 2,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871244068,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871244068,
        "changelog": "better-auth 0.1.0\n\n- Initial release of better-auth: self-hosted authentication for TypeScript/Cloudflare Workers with social auth, 2FA, passkeys, organizations, RBAC, and plugin support.\n- Supports Drizzle ORM or Kysely for database access on Cloudflare D1 (no direct adapter).\n- Provides detailed guides on D1 adapter use, per-request initialization, and framework integration (TanStack Start).\n- Includes extensive documentation on plugins, configuration patterns, and troubleshooting common issues."
      }
    },
    {
      "slug": "pandic-office",
      "displayName": "md-to-office",
      "summary": "Converts Markdown files to PDF files using the pandoc command-line utility. Use when a user asks to convert a .md or markdown file to a .pdf file.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 2,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871238870,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769871238870,
        "changelog": "- Initial release of the pandic-office (local-pandoc) skill.\n- Converts Markdown (.md) files to PDF using the pandoc command-line utility.\n- Provides basic and advanced usage examples, including HTML, DOCX, metadata, templates, CSS styling, and downloading content from URLs.\n- Covers PDF generation options with custom engines and document styling.\n- Includes examples for creating standalone documents, table of contents, and custom document metadata."
      }
    },
    {
      "slug": "auto-animate",
      "displayName": "Auto Animate",
      "summary": "Zero-config animations for React, Vue, Solid, Svelte, Preact with @formkit/auto-animate (3.28kb). Prevents 15 documented errors including React 19 StrictMode bugs, SSR imports, conditional parents, viewport issues, drag & drop conflicts, and CSS transform bugs.\n\nUse when: animating lists/accordions/toasts, troubleshooting SSR animation errors, React 19 StrictMode issues, or need accessible drop-in transitions with auto prefers-reduced-motion.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 2,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871219878,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871219878,
        "changelog": "Auto-animate v0.1.0 ÔÇö initial release with robust error prevention and animation patterns.\n\n- Introduces zero-config animations for React, Vue, Solid, Svelte, and Preact using @formkit/auto-animate.\n- Documents prevention for 15 common errors, including React 19 StrictMode bugs, SSR import issues, conditional parents, viewport problems, drag & drop conflicts, and CSS transform bugs.\n- Provides SSR-safe usage patterns essential for serverless frameworks (e.g., Next.js, Cloudflare Workers).\n- Includes framework-specific solutions, test/jest config guidance, and accessibility best practices for smooth, accessible transitions."
      }
    },
    {
      "slug": "ai-sdk-ui",
      "displayName": "Ai Sdk Ui",
      "summary": "Build React chat interfaces with Vercel AI SDK v6. Covers useChat/useCompletion/useObject hooks, message parts structure, tool approval workflows, and 18 UI error solutions. Prevents documented issues with React Strict Mode, concurrent requests, stale closures, and tool approval edge cases.\n\nUse when: implementing AI chat UIs, migrating v5ÔåÆv6, troubleshooting \"useChat failed to parse stream\", \"stale body values\", \"React maximum update depth\", \"Cannot read properties of undefined (reading 'state')\", or tool approval workflow errors.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 2,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871189588,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871189588,
        "changelog": "ai-sdk-ui v0.1.0\n\n- Initial release of ai-sdk-ui for building React chat interfaces with Vercel AI SDK v6.\n- Supports new message parts structure, type-safe agent integration, tool approval workflows, and auto-submit.\n- Provides 18 documented UI error solutions, addressing issues with React Strict Mode, concurrent requests, and stale closures.\n- Includes migration guidance from v5 to v6, highlighting breaking changes in hooks and state management.\n- Offers best practices and troubleshooting for common chat UI errors."
      }
    },
    {
      "slug": "ai-sdk-core",
      "displayName": "Ai Sdk Core",
      "summary": "Build backend AI with Vercel AI SDK v6 stable. Covers Output API (replaces generateObject/streamObject), speech synthesis, transcription, embeddings, MCP tools with security guidance. Includes v4ÔåÆv5 migration and 15 error solutions with workarounds.\n\nUse when: implementing AI SDK v5/v6, migrating versions, troubleshooting AI_APICallError, Workers startup issues, Output API errors, Gemini caching issues, Anthropic tool errors, MCP tools, or stream resumption failures.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 3,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871161364,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871161364,
        "changelog": "ai-sdk-core v0.1.0\n\n- Initial release for backend AI development with Vercel AI SDK v6 (stable).\n- Adds comprehensive Output API, replacing generateObject/streamObject (with migration guide).\n- Documents speech synthesis, transcription, embeddings, agent abstraction, and MCP tools with security guidance.\n- Includes guidance for v4ÔåÆv5 migration and 15 common error solutions.\n- Provides best practices for human-in-the-loop tool permissions and secure tool integration.\n- Offers troubleshooting help for key AI SDK platform issues."
      }
    },
    {
      "slug": "agent-development",
      "displayName": "Agent Development",
      "summary": "Design and build custom Claude Code agents with effective descriptions, tool access patterns,\nand self-documenting prompts. Covers Task tool delegation, model selection, memory limits,\nand declarative instruction design.\n\nUse when: creating custom agents, designing agent descriptions for auto-delegation,\ntroubleshooting agent memory issues, or building agent pipelines.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 7,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871109001,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871109001,
        "changelog": "agent-development 0.1.0 ÔÇö Initial Release\n\n- Provides guidelines for designing and building custom Claude Code agents.\n- Documents strong agent description patterns for effective auto-delegation.\n- Explains tool access principles and safe command allowlisting.\n- Details best practices for model selection, memory limits, and sub-agent usage.\n- Offers declarative prompt design templates and self-documentation recommendations.\n- Includes workflow tips for agent pipelines and effective prompt structuring."
      }
    },
    {
      "slug": "azure-identity-py",
      "displayName": "Azure Identity Py",
      "summary": "Azure Identity SDK for Python authentication. Use for DefaultAzureCredential, managed identity, service principals, and token caching.\nTriggers: \"azure-identity\", \"DefaultAzureCredential\", \"authentication\", \"managed identity\", \"service principal\", \"credential\".",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 2,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871072144,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871072144,
        "changelog": "Initial release of azure-identity-py skill.\n\n- Provides usage guidance for Azure Identity SDK authentication in Python.\n- Documents DefaultAzureCredential, managed identity, service principals, and token caching.\n- Includes credential chain order, environment variable setup, and async usage examples.\n- Covers best practices and credential selection for local and cloud scenarios."
      }
    },
    {
      "slug": "advanced-skill-creator",
      "displayName": "advanced-skill-creator",
      "summary": "Advanced OpenClaw skill creation handler that executes the official 5-step research flow with comprehensive analysis and best practices. Ensures proper methodology when users request to create or modify OpenClaw/Moltbot/ClawDBot skills following official standards.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 5,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769871070162,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769871070162,
        "changelog": "- Initial release of advanced-skill-creator.\n- Automates and enforces the official 5-step research flow for OpenClaw/Moltbot/ClawDBot skill creation and modification.\n- Ensures strict adherence to best practices, comprehensive analysis, and official documentation.\n- Provides standardized output structure with proper YAML frontmatter, metadata, and security considerations.\n- Integrates community-approved methodologies and thorough example use cases.\n- Implements advanced system prompt integration for enhanced AI-driven skill development."
      }
    },
    {
      "slug": "azure-storage-blob-py",
      "displayName": "Azure Storage Blob Py",
      "summary": "Azure Blob Storage SDK for Python. Use for uploading, downloading, listing blobs, managing containers, and blob lifecycle.\nTriggers: \"blob storage\", \"BlobServiceClient\", \"ContainerClient\", \"BlobClient\", \"upload blob\", \"download blob\".",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 2,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871049258,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871049258,
        "changelog": "Initial release of Azure Blob Storage SDK for Python skill.\n\n- Provides in-depth usage guide for uploading, downloading, listing, and managing blobs and containers.\n- Covers client hierarchy (`BlobServiceClient`, `ContainerClient`, `BlobClient`) and authentication using Azure Identity.\n- Includes code samples for all major operations, performance tuning (chunking, parallelism), and SAS token generation.\n- Documents advanced features: blob metadata, content headers, async client usage, and best practices.\n- Lists relevant environment variables and recommended settings for production use."
      }
    },
    {
      "slug": "fast-browser-use",
      "displayName": "Fastest Browser Use",
      "summary": "A high-performance browser automation tool and MCP server written in Rust, featuring headless Chrome control and DOM manipulation.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 5,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871030320,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769871030320,
        "changelog": "- Initial release of Fast Browser Use: a high-performance Rust tool for browser automation.\n- Supports headless and visible modes with direct Chrome DevTools Protocol control.\n- Provides zero Node.js dependencies; built entirely in Rust.\n- Includes Model Context Protocol (MCP) server for AI-driven integration.\n- Enables DOM extraction, navigation, clicking, input, and screenshot functionalities."
      }
    },
    {
      "slug": "github-issue-creator",
      "displayName": "Github Issue Creator",
      "summary": "Convert raw notes, error logs, voice dictation, or screenshots into crisp GitHub-flavored markdown issue reports. Use when the user pastes bug info, error messages, or informal descriptions and wants a structured GitHub issue. Supports images/GIFs for visual evidence.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 2,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769871024440,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769871024440,
        "changelog": "Initial release of github-issue-creator: convert raw bug reports into structured GitHub-style issues.\n\n- Transforms error logs, voice notes, screenshots, or informal problem descriptions into crisp, actionable Markdown issue files.\n- Extracts, infers, and organizes details (environment, reproduction steps, etc.) from unstructured user input.\n- Automatically creates issue reports as markdown files in the `/issues/` directory using a clear naming convention.\n- Supports inline referencing for attached images or GIFs.\n- Applies context-sensitive severity classification and redacts sensitive data with placeholders.\n- Includes example inputs and outputs for clarity."
      }
    },
    {
      "slug": "cryptocurrency-trader-skill",
      "displayName": "Cryptocurrency Trader",
      "summary": "Production-grade AI trading agent for cryptocurrency markets with advanced mathematical modeling, multi-layer validation, probabilistic analysis, and zero-hallucination tolerance. Implements Bayesian inference, Monte Carlo simulations, advanced risk metrics (VaR, CVaR, Sharpe), chart pattern recognition, and comprehensive cross-verification for real-world trading application.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 5,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769870875542,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769870875542,
        "changelog": "Initial release of cryptocurrency-trader-skill ÔÇö a production-grade AI crypto trading analysis agent.\n\n- Implements advanced mathematical modeling: Bayesian inference, Monte Carlo simulations, GARCH volatility, and risk metrics (VaR, CVaR, Sharpe).\n- Features a 6-stage validation pipeline with zero-hallucination tolerance and 14 circuit breakers for safe, accurate signal generation.\n- Offers comprehensive risk management, automated position sizing, and stop-loss/take-profit calculations.\n- Supports multi-timeframe analysis, statistical anomaly detection, and automated market scanning.\n- Includes clear user instructions, risk warnings, and beginner-friendly output explanations.\n- Provides programmatic integration, configuration options, and detailed reference documentation."
      }
    },
    {
      "slug": "technical-analyst",
      "displayName": "Technical Analyst",
      "summary": "This skill should be used when analyzing weekly price charts for stocks, stock indices, cryptocurrencies, or forex pairs. Use this skill when the user provides chart images and requests technical analysis, trend identification, support/resistance levels, scenario planning, or probability assessments based purely on chart data without consideration of news or fundamental factors.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 8,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769870456286,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769870456286,
        "changelog": "Initial release: Structured workflow and standards for image-based, objective technical analysis of weekly price charts.\n\n- Enables systematic analysis of stocks, indices, crypto, and forex weekly charts using only visible technical data.\n- Defines step-by-step process for trend, support/resistance, moving averages, volume, and pattern analysis.\n- Introduces probabilistic scenario planning, requiring 2-4 distinct scenarios with clearly justified probabilities.\n- Mandates comprehensive markdown reports following a standardized template and file naming convention.\n- Enforces strict objectivity: no news, fundamental, or sentiment input; all findings based solely on chart evidence.\n- Sets detailed quality standards for completeness, clarity, and analysis discipline."
      }
    },
    {
      "slug": "docker-containerization",
      "displayName": "Docker Containerization",
      "summary": "This skill should be used when containerizing applications with Docker, creating Dockerfiles, docker-compose configurations, or deploying containers to various platforms. Ideal for Next.js, React, Node.js applications requiring containerization for development, production, or CI/CD pipelines. Use this skill when users need Docker configurations, multi-stage builds, container orchestration, or deployment to Kubernetes, ECS, Cloud Run, etc.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 13,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769869688476,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769869688476,
        "changelog": "Initial release of Docker Containerization skill for modern web app containerization.\n\n- Generates optimized Dockerfiles for development, production, and static (Nginx) environments.\n- Provides docker-compose configurations for multi-container orchestration.\n- Includes robust bash scripts: build, run, push, and cleanup containers.\n- Offers .dockerignore and production Nginx config templates.\n- Extensive documentation: best practices, deployment guides (Kubernetes, ECS, Cloud Run, etc.), troubleshooting, and usage decision tree.\n- CI/CD integration examples for GitHub Actions and GitLab CI."
      }
    },
    {
      "slug": "codebase-documenter",
      "displayName": "Codebase Documenter",
      "summary": "This skill should be used when writing documentation for codebases, including README files, architecture documentation, code comments, and API documentation. Use this skill when users request help documenting their code, creating getting-started guides, explaining project structure, or making codebases more accessible to new developers. The skill provides templates, best practices, and structured approaches for creating clear, beginner-friendly documentation.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 13,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769869622469,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769869622469,
        "changelog": "Initial release of codebase-documenter: a skill for generating clear, structured documentation for codebases.\n\n- Provides templates and best practices for READMEs, architecture docs, code comments, and API documentation.\n- Emphasizes beginner-friendly documentation principles: clear \"why\" explanations, examples, context, and visual aids.\n- Outlines step-by-step workflow for analyzing codebases and choosing appropriate documentation types.\n- Includes detailed templates for README, architecture, and API docs in assets/templates/.\n- Covers inline code comment patterns for explaining complex or non-obvious code."
      }
    },
    {
      "slug": "research-paper-writer",
      "displayName": "Research Paper Writer",
      "summary": "Creates formal academic research papers following IEEE/ACM formatting standards with proper structure, citations, and scholarly writing style. Use when the user asks to write a research paper, academic paper, or conference paper on any topic.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 10,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769869553189,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769869553189,
        "changelog": "Initial release of Research Paper Writer: a tool for generating formal academic papers in IEEE/ACM style.\n\n- Guides users through clarifying research topics and paper scope.\n- Provides standard academic paper structure and section guidelines.\n- Enforces formal, scholarly writing style with section-specific conventions.\n- Offers detailed formatting instructions for IEEE and ACM publication standards.\n- Ensures proper citation and reference list formatting.\n- Outlines stepwise workflow for drafting, citing, and refining research papers."
      }
    },
    {
      "slug": "seo-optimizer",
      "displayName": "Seo Optimizer",
      "summary": "This skill should be used when analyzing HTML/CSS websites for SEO optimization, fixing SEO issues, generating SEO reports, or implementing SEO best practices. Use when the user requests SEO audits, optimization, meta tag improvements, schema markup implementation, sitemap generation, or general search engine optimization tasks.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 11,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769869520674,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769869520674,
        "changelog": "Initial release of the SEO Optimizer skill.\n\n- Analyze HTML/CSS websites for critical and technical SEO issues.\n- Generate detailed, prioritized SEO audit reports (human-readable and JSON output).\n- Suggest and guide fixes for meta tags, headings, alt attributes, markup, and more.\n- Automate sitemap generation, including priority/changefreq estimates.\n- Provide robots.txt management templates and instructions.\n- Guide schema markup implementation with common use cases and testing resources."
      }
    },
    {
      "slug": "deepclaw",
      "displayName": "Deepclaw",
      "summary": null,
      "tags": {
        "latest": "0.1.2"
      },
      "stats": {
        "comments": 0,
        "downloads": 8,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 3
      },
      "createdAt": 1769869417370,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.2",
        "createdAt": 1769871289120,
        "changelog": "- Added instructions for optional local installation of DeepClaw skill files.\n- Clarified that installation is not required; all necessary information is available via provided URLs.\n- No other major content changes."
      }
    },
    {
      "slug": "agent-orchestrator",
      "displayName": "Agent Orchestrator",
      "summary": "Meta-agent skill for orchestrating complex tasks through autonomous sub-agents. Decomposes macro tasks into subtasks, spawns specialized sub-agents with dynamically generated SKILL.md files, coordinates file-based communication, consolidates results, and dissolves agents upon completion.\n\nMANDATORY TRIGGERS: orchestrate, multi-agent, decompose task, spawn agents, sub-agents, parallel agents, agent coordination, task breakdown, meta-agent, agent factory, delegate tasks",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 30,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769868742777,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769868742777,
        "changelog": "Initial release of agent-orchestrator skill.\n\n- Enables orchestration of complex tasks by spawning autonomous sub-agents for parallelized work.\n- Dynamically generates SKILL.md files for specialized sub-agents, detailing roles and protocols.\n- Implements a file-based communication system (inbox/outbox/status) for coordination and state tracking.\n- Provides a step-by-step workflow: task decomposition, agent creation, dispatch, monitoring, consolidation, and dissolution.\n- Includes templates and best practices for defining and managing sub-agent workflows."
      }
    },
    {
      "slug": "gemini-image-simple",
      "displayName": "Gemini Image Simple",
      "summary": "Generate and edit images with Gemini API using pure Python stdlib. Zero dependencies - works on locked-down environments where pip/uv aren't available.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 10,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769868732799,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769868732799,
        "changelog": "Initial release - zero-dependency Gemini image generation"
      }
    },
    {
      "slug": "exchange-rates",
      "displayName": "Exchange Rates",
      "summary": "Fetch live exchange rates between any currency pairs from XE.com. Use when user asks about currency conversion, exchange rates, forex rates, or converting amounts between currencies (e.g., \"USD to INR\", \"100 EUR in GBP\", \"what's the dollar rate\").",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 16,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769868423163,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769868423163,
        "changelog": "Initial release: XE.com mid-market rates via Playwright, free API fallback, any currency pair"
      }
    },
    {
      "slug": "moltbook-interact",
      "displayName": "moltbook-interact",
      "summary": "Interact with Moltbook social network for AI agents. Post, reply, browse, and analyze engagement. Use when the user wants to engage with Moltbook, check their feed, reply to posts, or track their activity on the agent social network.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 72,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769867469132,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769868359788,
        "changelog": "- Removed the `scripts/test.sh` script and related documentation references.\n- Updated testing instructions to use `./scripts/moltbook.sh test` instead of the removed script.\n- Updated script references to mention only the remaining `moltbook.sh` script."
      }
    },
    {
      "slug": "evoweb-ai",
      "displayName": "EvoWeb.ai Website Builder",
      "summary": "Create a Website Designed to Bring Clients from ChatGPT, Gemini & Modern Search",
      "tags": {
        "latest": "1.0.2"
      },
      "stats": {
        "comments": 0,
        "downloads": 15,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 3
      },
      "createdAt": 1769862042613,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.2",
        "createdAt": 1769862441761,
        "changelog": "Version 1.0.2\n\n- Added a new markdown metadata block with skill name, description, homepage, and environment variable requirements.\n- Updated the skill description to emphasize compatibility with ChatGPT, Gemini, and modern search platforms.\n- No code or functional changes; documentation and metadata enhancements only."
      }
    },
    {
      "slug": "clawhub",
      "displayName": "Clawhub",
      "summary": "Use the ClawHub CLI to search, install, update, and publish agent skills from clawhub.ai with advanced caching and compression. Use when you need to fetch new skills on the fly, sync installed skills to latest or a specific version, or publish new/updated skill folders with optimized performance.",
      "tags": {
        "latest": "1.0.4"
      },
      "stats": {
        "comments": 1,
        "downloads": 5393,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 5
      },
      "createdAt": 1769861969601,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.4",
        "createdAt": 1769867907278,
        "changelog": "- Updated documentation to reference \"clawhub.ai\" instead of \"clawhub.com\" throughout the skill.\n- No functionality changes; this update is documentation only."
      }
    },
    {
      "slug": "local-rag-search",
      "displayName": "Local Rag Search",
      "summary": "Efficiently perform web searches using the mcp-local-rag server with semantic similarity ranking. Use this skill when you need to search the web for current information, research topics across multiple sources, or gather context from the internet without using external APIs. This skill teaches effective use of RAG-based web search with DuckDuckGo, Google, and multi-engine deep research capabilities.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 54,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769859770944,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769859770944,
        "changelog": "Initial release of local-rag-search skill.\n\n- Enables efficient, privacy-conscious web searches using the mcp-local-rag server with semantic similarity ranking.\n- Supports DuckDuckGo and Google for targeted search, plus multi-engine deep research across various providers including Wikipedia and Bing.\n- Provides clear guidelines on tool selection, query formulation, and parameter tuning for effective results.\n- Emphasizes citing sources and privacy best practices.\n- Includes troubleshooting and performance tips for comprehensive and responsive searching."
      }
    },
    {
      "slug": "feishu-card",
      "displayName": "Feishu Interactive Card",
      "summary": null,
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 10,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769859253075,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769859253075,
        "changelog": "- Initial release of the Feishu Card Skill.\n- Send interactive rich text cards to Feishu users via the App Bot API.\n- Supports title, markdown body (inline or from file), header color, and action button with URL.\n- Enables complex message layouts that surpass the default message tool's capabilities."
      }
    },
    {
      "slug": "backup",
      "displayName": "OpenClaw Backup",
      "summary": "Backup and restore openclaw configuration, skills, commands, and settings. Sync across devices, version control with git, automate backups, and migrate to new machines.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 314,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769856578186,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769856578186,
        "changelog": "- Initial release of the OpenClaw Backup skill.\n- Provides tools to backup, restore, and sync OpenClaw configuration, skills, commands, and settings.\n- Supports local and multi-device migration, version control using git, and automated backup routines.\n- Includes detailed documentation and a comprehensive backup script with backup, restore, cleanup, and stats functionality.\n- Specifies required dependencies: git, tar, and rsync."
      }
    },
    {
      "slug": "flowmind",
      "displayName": "FlowMind",
      "summary": "Manage productivity with FlowMind ÔÇö goals, tasks (with subtasks), notes, people, and tags via REST API. Use when the user wants to create, list, update, or delete goals, tasks, notes, contacts, or tags; manage focus/priorities; track progress; or organize their productivity workspace through FlowMind.",
      "tags": {
        "latest": "1.0.2"
      },
      "stats": {
        "comments": 0,
        "downloads": 48,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769852255841,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.2",
        "createdAt": 1769852295339,
        "changelog": "Re-publish: updated API docs and skill references"
      }
    },
    {
      "slug": "agentwallet",
      "displayName": "A wallet for your agent",
      "summary": "Give your AI agent its own blockchain wallet without ever exposing private keys.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 22,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769849819018,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769851351532,
        "changelog": "- Initial public release of AgentWallet skill (version 1.0.0).\n- Provides an AI agent with a secure blockchain wallet while never exposing private keys.\n- Allows customizable wallet policies such as address and token allowlists, spending limits, and approval requirements.\n- Supports wallet creation, balance checks, token/ETH transfers, and arbitrary smart contract interactions via API.\n- Includes detailed setup and usage instructions in the documentation."
      }
    },
    {
      "slug": "memory-manager",
      "displayName": "Memory Manager",
      "summary": "Local memory management for agents. Compression detection, auto-snapshots, and semantic search. Use when agents need to detect compression risk before memory loss, save context snapshots, search historical memories, or track memory usage patterns. Never lose context again.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 172,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769842400221,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769842400221,
        "changelog": "Initial release: Semantic/procedural/episodic memory architecture for agents. Knowledge graphs beat flat retrieval by 18.5%. Never lose context again."
      }
    },
    {
      "slug": "self-reflection",
      "displayName": "Self Reflection",
      "summary": "Continuous self-improvement through structured reflection and memory",
      "tags": {
        "latest": "1.1.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 155,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769841628025,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.1",
        "createdAt": 1769841628025,
        "changelog": "Initial ClawHub release: Continuous self-improvement through structured reflection"
      }
    },
    {
      "slug": "moltbook-registry",
      "displayName": "Moltbook Agent Registry",
      "summary": "Official Moltbook Identity Registry interface. Verify yourself, lookup others, and build on-chain reputation.",
      "tags": {
        "latest": "1.0.2"
      },
      "stats": {
        "comments": 0,
        "downloads": 285,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 3
      },
      "createdAt": 1769839618648,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.2",
        "createdAt": 1769857013345,
        "changelog": "- Added an optional `agentWallet` parameter to the `registry_register` tool, allowing users to specify an operational wallet (defaults to `msg.sender` if not provided).\n- No other changes detected.\n- Soulbound status added"
      }
    },
    {
      "slug": "spark-engineer",
      "displayName": "Spark Engineer",
      "summary": "Use when building Apache Spark applications, distributed data processing pipelines, or optimizing big data workloads. Invoke for DataFrame API, Spark SQL, RDD operations, performance tuning, streaming analytics.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 12,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769839003707,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769839003707,
        "changelog": "Initial release of spark-engineer skill.\n\n- Provides expert support for building and optimizing Apache Spark applications, ETL pipelines, and streaming analytics.\n- Covers workflows for requirement analysis, pipeline design, implementation, optimization, and validation.\n- Includes reference guides for DataFrame API, Spark SQL, RDD operations, partitioning, caching, performance tuning, and streaming.\n- Lists critical best practices and anti-patterns for production Spark workloads.\n- Supplies structured output templates including code, configurations, partitioning strategies, performance analysis, and monitoring advice."
      }
    },
    {
      "slug": "terraform-engineer",
      "displayName": "Terraform Engineer",
      "summary": "Use when implementing infrastructure as code with Terraform across AWS, Azure, or GCP. Invoke for module development, state management, provider configuration, multi-environment workflows, infrastructure testing.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 18,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769838849955,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769838849955,
        "changelog": "Initial release of terraform-engineer skill.\n\n- Provides guidance for implementing Terraform-based infrastructure as code across AWS, Azure, and GCP.\n- Covers module development, provider configuration, remote state management, and multi-environment workflows.\n- Includes best practices and must/must-not constraints for security, compliance, and maintainability.\n- Offers structured output templates for module creation and infrastructure design.\n- Reference guides for modules, state management, providers, testing, and best practices."
      }
    },
    {
      "slug": "test-master",
      "displayName": "Test Master",
      "summary": "Use when writing tests, creating test strategies, or building automation frameworks. Invoke for unit tests, integration tests, E2E, coverage analysis, performance testing, security testing.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 28,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769838846815,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769838846815,
        "changelog": "Initial release of test-master skill.\n\n- Provides comprehensive guidance on unit, integration, E2E, performance, and security testing.\n- Includes reference guides for test methodologies, automation frameworks, and quality metrics.\n- Outlines core workflows for defining scope, strategizing, test implementation, execution, and reporting.\n- Specifies mandatory testing practices and common constraints.\n- Supports test planning with structured output templates and severity-based findings.\n- Lists related testing skills and contextual knowledge sources."
      }
    },
    {
      "slug": "cli-developer",
      "displayName": "Cli Developer",
      "summary": "Use when building CLI tools, implementing argument parsing, or adding interactive prompts. Invoke for CLI design, argument parsing, interactive prompts, progress indicators, shell completions.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 38,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769838605053,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769838605053,
        "changelog": "- Initial release of the cli-developer skill.\n- Provides expertise in building fast, user-friendly command-line tools across Node.js, Python, and Go.\n- Covers argument parsing, subcommands, interactive prompts, progress indicators, and shell completions.\n- Outlines best practices for UX, error handling, startup time, and cross-platform support.\n- Includes clear role definition, workflow, output templates, and usage constraints."
      }
    },
    {
      "slug": "api-designer",
      "displayName": "Api Designer",
      "summary": "Use when designing REST or GraphQL APIs, creating OpenAPI specifications, or planning API architecture. Invoke for resource modeling, versioning strategies, pagination patterns, error handling standards.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 30,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769838271122,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769838271122,
        "changelog": "Initial release of api-designer skill:\n\n- Provides expert guidance for designing REST and GraphQL APIs, including OpenAPI 3.1 specifications.\n- Covers resource modeling, endpoint design, error handling, versioning, pagination, and authentication.\n- Includes detailed reference guides and mandatory design constraints.\n- Outputs comprehensive API specifications, documentation templates, and best practices."
      }
    },
    {
      "slug": "phone-agent",
      "displayName": "Phone Voice Agent",
      "summary": "Run a real-time AI phone agent using Twilio, Deepgram, and ElevenLabs. Handles incoming calls, transcribes audio, generates responses via LLM, and speaks back via streaming TTS. Use when user wants to: (1) Test voice AI capabilities, (2) Handle phone calls programmatically, (3) Build a conversational voice bot.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 15,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769838219955,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769838219955,
        "changelog": "Initial ClawHub release"
      }
    },
    {
      "slug": "activecampaign",
      "displayName": "ActiveCampaign CRM",
      "summary": "ActiveCampaign CRM integration for lead management, deal tracking, and email automation. Use for syncing demo leads, managing clinic sales pipeline, and triggering follow-up sequences.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 15,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769838080847,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769838080847,
        "changelog": "Initial ClawHub release"
      }
    },
    {
      "slug": "campaign-orchestrator",
      "displayName": "Campaign Orchestrator",
      "summary": "Multi-channel follow-up campaign orchestrator for ShapeScale sales. Schedules and executes SMS + Email sequences with CRM logging and auto-termination on replies. Use when following up with demo leads or managing outreach campaigns.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 3,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769838051934,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769838051934,
        "changelog": "Initial ClawHub release"
      }
    },
    {
      "slug": "dialpad",
      "displayName": "Dialpad SMS & Voice",
      "summary": "Send SMS and make voice calls via Dialpad API. Supports single/batch SMS, voice calls with TTS, and caller ID selection.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 7,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769837993633,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769837993633,
        "changelog": "Initial ClawHub release"
      }
    },
    {
      "slug": "soulcraft",
      "displayName": "SoulCraft",
      "summary": "Create or improve SOUL.md files for OpenClaw agents through guided conversation. Use when designing agent personality, crafting a soul, or saying \"help me create a soul\". Supports self-improvement.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 33,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769837657106,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769837657106,
        "changelog": "Initial release: guided SOUL.md creation, improvement mode, self-reflection mode, IDENTITY.md integration"
      }
    },
    {
      "slug": "byterover-headless",
      "displayName": "ByteRover - Headless",
      "summary": "Query and curate knowledge-base using ByteRover CLI. Use `brv query` for knowledge retrieval, `brv curate` for adding context, and `brv push/pull` for syncing.",
      "tags": {
        "latest": "1.6.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 46,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769836616861,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.6.0",
        "createdAt": 1769836616861,
        "changelog": "- Major update: Comprehensive SKILL.md added with detailed headless usage instructions for ByteRover CLI.\n- Provides example commands and JSON responses for querying, curating, pushing, and pulling knowledge.\n- Adds clear guidance for authentication, project initialization, and error handling in headless/automated environments.\n- Outlines recommended flags (`--headless --format json`), best practices, and tips for automation workflows.\n- Documents possible statuses and expected outputs for all supported commands."
      }
    },
    {
      "slug": "moltlist",
      "displayName": "Moltlist Agent-to-Agent Marketplace",
      "summary": "Agent-to-agent marketplace with escrow payments. Use this skill when you want to list services, hire other agents, browse available services, create escrows, or manage transactions on MoltList.",
      "tags": {
        "a2a": "1.1.1",
        "agent": "1.1.1",
        "base": "1.1.1",
        "crypto": "1.1.1",
        "gig": "1.1.1",
        "latest": "1.1.1",
        "market": "1.1.1",
        "sale": "1.1.1",
        "usd": "1.1.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 14,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769832044355,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.1",
        "createdAt": 1769871529069,
        "changelog": "**This version introduces a streamlined, beginner-friendly experience and a Welcome Job for new agents.**\n\n- Adds onboarding content and instructions directly for new users, including sample invite messages for humans.\n- Highlights a new \"Welcome Job\" that gives every new agent a paid ($0.50) first task when they list a service.\n- Prominently features quick start steps and proof of live activity.\n- Requires `agent_name` and `notification_url` when creating a service listing.\n- Keeps all technical/reference documentation, but moves key agent actions and setup steps to the top."
      }
    },
    {
      "slug": "rssaurus",
      "displayName": "RSSaurus - Agent-Friendly RSS Feed Reader",
      "summary": "Use the RSSaurus command-line client (Go binary `rssaurus`) to interact with https://rssaurus.com from the terminal: authenticate (`rssaurus auth login/whoami`), list feeds/items, print item URLs for piping, open URLs, and perform triage actions (mark read/unread, bulk mark-read, save/unsave). Use when asked to automate RSSaurus tasks from CLI, debug token/config issues, or demonstrate command usage.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 26,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769831808232,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769831808232,
        "changelog": "Initial release of rssaurus-cli skill.\n\n- Provides guidance on using the rssaurus CLI tool to interact with RSSaurus from the terminal.\n- Includes troubleshooting steps for binary presence, configuration, and authentication.\n- Documents commands for listing feeds/items, marking items read/unread, saving/unsaving items, and opening URLs.\n- Explains how to use machine-friendly outputs and manage bulk actions.\n- Shares reference links for further CLI help and authentication token generation."
      }
    },
    {
      "slug": "x-twitter",
      "displayName": "x-twitter",
      "summary": "Interact with Twitter/X ÔÇö read tweets, search, post, like, retweet, and manage your timeline.",
      "tags": {
        "latest": "2.3.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 67,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769828606414,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "2.3.1",
        "createdAt": 1769828606414,
        "changelog": "- Rebranded skill as \"twitter-openclaw\" with updated description and emoji\n- Expanded documentation with detailed authentication instructions and command examples for all major Twitter/X actions (read, post, search, engage, manage lists)\n- Clarified output formatting options and result customization flags\n- Added operational guidelines (confirmation before write actions, output formatting, rate limiting)\n- Improved troubleshooting section for common errors (authorization, rate limiting)"
      }
    },
    {
      "slug": "canva-connect",
      "displayName": "Canva Connect",
      "summary": "Manage Canva designs, assets, and folders via the Connect API.\n\nWHAT IT CAN DO:\n- List/search/organize designs and folders\n- Export finished designs (PNG/PDF/JPG)\n- Upload images to asset library\n- Autofill brand templates with data\n- Create blank designs (doc/presentation/whiteboard/custom)\n\nWHAT IT CANNOT DO:\n- Add content to designs (text, shapes, elements)\n- Edit existing design content\n- Upload documents (images only)\n- AI design generation\n\nBest for: asset pipelines, export automation, organization, template autofill.\nTriggers: /canva, \"upload to canva\", \"export design\", \"list my designs\", \"canva folder\".",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 7,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769735275413,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769735275413,
        "changelog": "Initial release: design management, asset uploads, folder organization, export automation"
      }
    },
    {
      "slug": "senior-backend",
      "displayName": "Senior Backend",
      "summary": "This skill should be used when the user asks to \"design REST APIs\", \"optimize database queries\", \"implement authentication\", \"build microservices\", \"review backend code\", \"set up GraphQL\", \"handle database migrations\", or \"load test APIs\". Use for Node.js/Express/Fastify development, PostgreSQL optimization, API security, and backend architecture patterns.",
      "tags": {
        "backend": "0.1.0",
        "engineering": "0.1.0",
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 9,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769735052022,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769735052022,
        "changelog": "- Initial release of the \"senior-backend\" skill, designed for advanced backend engineering tasks.\n- Provides workflows and tools for REST API design, database query optimization, authentication, microservices, code review, GraphQL setup, migrations, and API load testing.\n- Supports Node.js/Express/Fastify development, PostgreSQL optimization, API security, and backend architecture patterns.\n- Includes reference workflows and usage examples for API scaffolding, database migration automation, and performance/load testing.\n- Offers quick commands, boilerplate code, and best practices documentation for common backend scenarios."
      }
    },
    {
      "slug": "language-learning",
      "displayName": "Language Learning Tutor",
      "summary": "AI language tutor for learning ANY language through conversation, vocab drills, grammar lessons, flashcards, and immersive practice. Use when the user wants to: learn a new language, practice vocabulary, study grammar, do flashcard drills, translate phrases, practice conversation, prepare for travel, learn slang/idioms, or improve pronunciation. Supports ALL languages including Spanish, French, German, Japanese, Chinese (Mandarin/Cantonese), Korean, Arabic, Hindi, Bengali/Bangla, Portuguese, Russian, Italian, Turkish, Vietnamese, Thai, Swahili, Hebrew, Polish, Dutch, Greek, and 100+ more.",
      "tags": {
        "DELE": "1.0.0",
        "DELF": "1.0.0",
        "HSK": "1.0.0",
        "JLPT": "1.0.0",
        "arabic": "1.0.0",
        "bangla": "1.0.0",
        "chinese": "1.0.0",
        "conversation": "1.0.0",
        "culture": "1.0.0",
        "duolingo-alternative": "1.0.0",
        "education": "1.0.0",
        "exam-prep": "1.0.0",
        "flashcards": "1.0.0",
        "french": "1.0.0",
        "german": "1.0.0",
        "grammar": "1.0.0",
        "hindi": "1.0.0",
        "idioms": "1.0.0",
        "immersion": "1.0.0",
        "italian": "1.0.0",
        "japanese": "1.0.0",
        "korean": "1.0.0",
        "language": "1.0.0",
        "latest": "1.0.0",
        "learning": "1.0.0",
        "polyglot": "1.0.0",
        "portuguese": "1.0.0",
        "pronunciation": "1.0.0",
        "russian": "1.0.0",
        "slang": "1.0.0",
        "spaced-repetition": "1.0.0",
        "spanish": "1.0.0",
        "translation": "1.0.0",
        "travel": "1.0.0",
        "tutor": "1.0.0",
        "vocabulary": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 22,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769733977182,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769733977182,
        "changelog": "Initial release: AI language tutor supporting 100+ languages with 7 teaching modes (vocab builder, grammar lessons, conversation practice, flashcard drills, script/writing systems, cultural context, exam prep)"
      }
    },
    {
      "slug": "web-deploy-github",
      "displayName": "Web Deploy GitHub Pages",
      "summary": "Create and deploy single-page static websites to GitHub Pages with autonomous workflow. Use when building portfolio sites, CV pages, landing pages, or any static web project that needs GitHub Pages deployment. Handles complete workflow from project initialization to live deployment with GitHub Actions automation.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 31,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769721637588,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769721637588,
        "changelog": "v1.0.0 - Initial Release\n\nFeatures:\n- Complete workflow for creating and deploying static websites to GitHub Pages\n- Automated deployment scripts (init_project.sh, deploy_github_pages.sh)\n- Three ready-to-use templates: base HTML, portfolio/CV, and landing page\n- Comprehensive design patterns and best practices documentation\n- Mobile-first responsive design patterns\n- GitHub Actions integration for automatic deployment\n- Modern CSS and JavaScript patterns\n- Full documentation of autonomous generation workflow"
      }
    },
    {
      "slug": "yahoo-finance-cli",
      "displayName": "Yahoo Finance CLI",
      "summary": "This skill should be used when the user asks to \"get stock prices\", \"check stock quotes\", \"look up earnings\", \"get financial data\", \"find trending stocks\", or needs stock market data from Yahoo Finance.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 128,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769720161795,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769720161795,
        "changelog": "Initial release."
      }
    },
    {
      "slug": "prompt-guard",
      "displayName": "Prompt Guard",
      "summary": "Advanced prompt injection defense system for Clawdbot. Protects against direct/indirect injection attacks in group chats with multi-language detection (EN/KO/JA/ZH), severity scoring, automatic logging, and configurable security policies. Use in any group context to restrict sensitive commands to owner and detect manipulation attempts.",
      "tags": {
        "latest": "2.5.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 480,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 8,
        "versions": 7
      },
      "createdAt": 1769702331506,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "2.5.1",
        "createdAt": 1769836591301,
        "changelog": "prompt-guard v2.5.1\n\n- Added critical detection for LLM system prompt mimicry (e.g. fake Claude/Anthropic/GPT/LLM tokens, tags, and famous jailbreak markers).\n- Blocks attacks attempting to poison session context via `<claude_*>`, `<|im_start|>`, `[INST]`, `GODMODE`, `DAN`, `JAILBREAK`, leetspeak variants, and similar prompts.\n- Expanded detection coverage for real-world prompt injection and context poisoning exploits.\n- New documentation: Added SECURITY.md and blog post explaining new defenses.\n- Updated and reorganized SKILL.md for improved clarity."
      }
    },
    {
      "slug": "find-skills",
      "displayName": "Find Skills",
      "summary": "Helps users discover and install agent skills when they ask questions like \"how do I do X\", \"find a skill for X\", \"is there a skill that can...\", or express interest in extending capabilities. This skill should be used when the user is looking for functionality that might exist as an installable skill.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 419,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 5,
        "versions": 1
      },
      "createdAt": 1769698710765,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769698710765,
        "changelog": "- Initial release of the find-skills skill.\n- Helps users discover and install agent skills when looking for new functionality or extending agent capabilities.\n- Provides clear guidance on searching for, presenting, and installing skills using Skills CLI commands.\n- Includes examples and tips for effective skill discovery across common categories like web development, testing, and DevOps.\n- Offers fallback options when no relevant skills are found, including help with tasks directly and guidance on creating new skills."
      }
    },
    {
      "slug": "gaokao-history-tutor",
      "displayName": "gaokao-history-tutor",
      "summary": null,
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 2,
        "downloads": 1154,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 2
      },
      "createdAt": 1769694742385,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769698956513,
        "changelog": "- Initial public release of gaokao-history-tutor.\n- Added core files for skill operation.\n- Provides high school (gaokao) history tutoring in the style of a Chinese senior-year teacher, emphasizing logical analysis and context.\n- Includes specific guidance for political, economic, and cultural history, as well as strategies for common student challenges."
      }
    },
    {
      "slug": "agent-browser-3",
      "displayName": "Agent Browser",
      "summary": "Automates browser interactions for web testing, form filling, screenshots, and data extraction. Use when the user needs to navigate websites, interact with web pages, fill forms, take screenshots, test web applications, or extract information from web pages.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 402,
        "installsAllTime": 3,
        "installsCurrent": 3,
        "stars": 2,
        "versions": 1
      },
      "createdAt": 1769694571134,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769694571134,
        "changelog": "Initial release of agent-browser: Powerful command-line browser automation.\n\n- Automates website navigation, form filling, testing, screenshots, and data extraction.\n- Extensive command set for browser control, interactive element referencing, state checks, and data capture.\n- Supports semantic locators (find by role, label, text, etc.) for robust automation.\n- Provides tools for video recordings, PDF creation, network interception, tab/window management, storage/cookie handling, and more.\n- Includes options for session isolation, headless/headed mode, and structured JSON output."
      }
    },
    {
      "slug": "curl-http",
      "displayName": "Curl Http",
      "summary": "Essential curl commands for HTTP requests, API testing, and file transfers.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 52,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769692053458,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769692053458,
        "changelog": "curl-http 1.0.0 ÔÇô Initial Release\n\n- Provides essential curl command examples for HTTP requests, API testing, and file transfers.\n- Covers usage for GET, POST, PUT, DELETE, and PATCH requests, authentication methods, custom headers, cookies, proxy, and SSL/TLS options.\n- Includes examples for file downloads/uploads, response formatting, range requests, and performance testing.\n- Offers tips for scripting, debugging, and common usage patterns.\n- Lists helpful curl flags and links to official documentation."
      }
    },
    {
      "slug": "git-essentials",
      "displayName": "Git Essentials",
      "summary": "Essential Git commands and workflows for version control, branching, and collaboration.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 164,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769692045864,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769692045864,
        "changelog": "Initial release of git-essentials.\n\n- Provides essential Git commands for setup, version control, branching, remote operations, stashing, rebasing, tagging, submodules, and cleaning.\n- Includes common workflows for feature branches, hotfixes, and syncing forks.\n- Offers helpful aliases, practical tips, and solutions to common issues.\n- Links to official Git documentation and resources for further learning."
      }
    },
    {
      "slug": "nano-banana",
      "displayName": "Nano Banana",
      "summary": null,
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 72,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769688042763,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769688657433,
        "changelog": "- Added skill.json file for initial skill configuration and metadata.\n- No other functional or documentation changes."
      }
    },
    {
      "slug": "serpapi-mcp",
      "displayName": "SerpAPI MCP",
      "summary": "Run SerpAPI searches via SerpAPI's MCP server using mcporter. Use when the user asks to search the web with SerpAPI/SerpAPI MCP, wants SerpAPI inside Clawdbot, or to use the /serp command.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 8,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769687090053,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769687090053,
        "changelog": "Initial release: /serp command wrapper for SerpAPI MCP via mcporter."
      }
    },
    {
      "slug": "canva",
      "displayName": "Canva",
      "summary": "Create, export, and manage Canva designs via the Connect API. Generate social posts, carousels, and graphics programmatically.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 86,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769684214453,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769684214453,
        "changelog": "Initial public release of Canva Skill.\n\n- Create, export, and manage Canva designs via the Connect API.\n- Supports generating social media posts, carousels, and graphics programmatically.\n- Includes operations for listing, creating, exporting designs, uploading assets, and managing templates.\n- Detailed usage instructions, authentication steps, and error handling guidance provided.\n- Requires Canva API credentials (Client ID and Secret) for setup."
      }
    },
    {
      "slug": "transcribee",
      "displayName": "Transcribee ­ƒÉØ",
      "summary": "Transcribe YouTube videos and local audio/video files with speaker diarization. Use when user asks to transcribe a YouTube URL, podcast, video, or audio file. Outputs clean speaker-labeled transcripts ready for LLM analysis.",
      "tags": {
        "latest": "1.2.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 102,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 4
      },
      "createdAt": 1769680043792,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.2.1",
        "createdAt": 1769717135760,
        "changelog": "Add TikTok support to docs"
      }
    },
    {
      "slug": "tiangong-wps-word-automation",
      "displayName": "Word Automation",
      "summary": "Automate common Word/WPS document operations on Windows via COM (read text, replace, insert, headings, headers/footers, page breaks, merge, split, export to PDF/TXT, add/replace images). Use for single-document actions (no batch).",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 89,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769676339736,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769676339736,
        "changelog": "Initial release: Automate Word/WPS document operations on Windows from the command line.\n\n- Supports reading text, find/replace, text insertion, heading formatting, header/footer editing, and page breaks.\n- Allows merging, splitting, and exporting documents to PDF or TXT.\n- Images can be added or replaced at the document end.\n- Single-document operations only; batch processing not supported.\n- Requires Windows, Microsoft Word or WPS Writer, and Python with pywin32."
      }
    },
    {
      "slug": "web-search",
      "displayName": "Web Search",
      "summary": "This skill should be used when users need to search the web for information, find current content, look up news articles, search for images, or find videos. It uses DuckDuckGo's search API to return results in clean, formatted output (text, markdown, or JSON). Use for research, fact-checking, finding recent information, or gathering web resources.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 486,
        "installsAllTime": 4,
        "installsCurrent": 4,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769673454302,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769673454302,
        "changelog": "web-search 1.0.0\n\n- Initial release of the skill.\n- Search the web using DuckDuckGoÔÇÖs API for web pages, news, images, and videos.\n- Supports multiple result formats: plain text, markdown, and JSON.\n- Includes rich filtering (time range, region, safe search) and content-type options.\n- Image and video searches offer flexible filters (size, color, type, duration, resolution, layout).\n- Allows saving results to files for further use."
      }
    },
    {
      "slug": "stock-info-explorer",
      "displayName": "Stock Info Explorer",
      "summary": "A Yahoo Finance (yfinance) powered financial analysis tool. Get real-time quotes, generate high-resolution charts with moving averages + indicators (RSI/MACD/Bollinger/VWAP/ATR), summarize fundamentals, and run a one-shot report that outputs both a text summary and a Pro chart.",
      "tags": {
        "latest": "1.2.10"
      },
      "stats": {
        "comments": 0,
        "downloads": 259,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 2,
        "versions": 6
      },
      "createdAt": 1769671618947,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.2.10",
        "createdAt": 1769694294993,
        "changelog": "Docs: rewrite SKILL.md in English for global users."
      }
    },
    {
      "slug": "stock-market-pro",
      "displayName": "Stock Market Pro",
      "summary": "Professional stock price tracking, fundamental analysis, and financial reporting tool. Supports global markets (US, KR, etc.), Crypto, and Forex with real-time data. (1) Real-time quotes, (2) Valuation metrics (PE, EPS, ROE), (3) Earnings calendar and consensus, (4) High-quality Candlestick & Line charts with technical indicators (MA5/20/60).",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 3,
        "downloads": 365,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 3,
        "versions": 2
      },
      "createdAt": 1769671384220,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769671465508,
        "changelog": "English localization and improved metadata for global users."
      }
    },
    {
      "slug": "ddg-search",
      "displayName": "DuckDuckGo Search",
      "summary": "Perform web searches using DuckDuckGo. Use when web search is needed and no API key is available or Brave Search is not preferred.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 374,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 2,
        "versions": 1
      },
      "createdAt": 1769670946614,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769670946614,
        "changelog": "Initial release of DuckDuckGo search skill."
      }
    },
    {
      "slug": "clean-code",
      "displayName": "Clean Code",
      "summary": "Pragmatic coding standards - concise, direct, no over-engineering, no unnecessary comments",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 1,
        "downloads": 224,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 4,
        "versions": 1
      },
      "createdAt": 1769666446290,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769666446290,
        "changelog": "Major update: The skill has been overhauled for strict, pragmatic coding standards and robust validation requirements.\n\n- Expanded coding standards with explicit, actionable \"Do\" and \"Don't\" lists, core principles, and anti-pattern tables.\n- Added mandatory self-checklists for agents to validate goal completion, code correctness, and coverage of all requirements before completing tasks.\n- Introduced required validation script mapping per agent skill, with strict output handling, summarized reporting, and confirmation before fixing issues.\n- Enforced concise, self-documenting codeÔÇöno unnecessary comments or abstractions; small, focused functions; and direct responses to user requests.\n- Updated rules for naming, code structure, and file editing responsibilities to prevent breakage and ensure maintainability.\n- Raised skill priority to CRITICAL and version to 2.0."
      }
    },
    {
      "slug": "catbox-upload",
      "displayName": "Upload files to catbox.moe (permanent) or litterbox.catbox.moe (temporary).",
      "summary": null,
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 33,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769660845775,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769660845775,
        "changelog": "Initial release of Catbox/Litterbox File Uploader.\n\n- Supports uploading files to catbox.moe (permanent) and litterbox.catbox.moe (temporary).\n- Allows specifying expiry time for Litterbox uploads (1h, 12h, 24h, 72h).\n- Option to upload to Catbox with userhash for account tracking.\n- Provides limits for file size and duration by service.\n- Returns the direct URL of the uploaded file on success."
      }
    },
    {
      "slug": "ai-compound",
      "displayName": "Compound Engineering",
      "summary": "Make your AI agent learn and improve automatically. Reviews sessions, extracts learnings, updates memory files, and compounds knowledge over time. Set up nightly review loops that make your agent smarter every day.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 562,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 13,
        "versions": 2
      },
      "createdAt": 1769658274325,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769663248108,
        "changelog": "- Removed package.json from the project.\n- Minor update to project documentation in SKILL.md, adding contact and repository links at the end."
      }
    },
    {
      "slug": "ai-code-review",
      "displayName": "Code Review Assistant",
      "summary": null,
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 130,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769658227598,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769665387329,
        "changelog": "- Project structure simplified by removing source code, configuration, and documentation files.\n- SKILL.md updated to add a \"Built by LXGIC Studios\" section with direct links to the project's GitHub and Twitter.\n- All other documentation and functionality descriptions remain unchanged."
      }
    },
    {
      "slug": "ai-diff-summary",
      "displayName": "Git Diff Summarizer",
      "summary": "Summarize git diffs in plain English",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 38,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769657852963,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769665950817,
        "changelog": "- Added attribution and contact links to LXGIC Studios at the end of documentation.\n- Removed multiple files including build outputs, source code, and project metadata, leaving only SKILL.md."
      }
    },
    {
      "slug": "system-monitor",
      "displayName": "System Monitor",
      "summary": "Check the current CPU, RAM, and GPU status of the local server.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 290,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 3,
        "versions": 1
      },
      "createdAt": 1769655125434,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769655125434,
        "changelog": "- Initial release of the System Monitor skill.\n- Allows checking current CPU, RAM, and GPU status of the local server.\n- Provides instructions for running the local monitoring script (`./monitor.sh`).\n- Designed for queries related to server health and hardware usage."
      }
    },
    {
      "slug": "wecom",
      "displayName": "WeCom",
      "summary": "Send messages to WeCom (õ╝üõ©ÜÕ¥«õ┐í) via webhooks using MCP protocol. Works with Claude Code, Claude Desktop, and other MCP clients.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 4,
        "downloads": 59,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 1
      },
      "createdAt": 1769648402810,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769648402810,
        "changelog": "- Initial release of the WeCom skill.\n- Send text and markdown messages to WeCom (õ╝üõ©ÜÕ¥«õ┐í) using webhooks and MCP protocol.\n- Includes two tools: send_wecom_message (text with optional mentions) and send_wecom_markdown (WeCom-flavored markdown).\n- Provides setup instructions and environment variable configuration.\n- Compatible with Claude Code, Claude Desktop, and other MCP clients."
      }
    },
    {
      "slug": "adhd-daily-planner",
      "displayName": "ADHD Daily Planner",
      "summary": "Time-blind friendly planning, executive function support, and daily structure for ADHD brains. Specializes in realistic time estimation, dopamine-aware task design, and building systems that actually work for neurodivergent minds.",
      "tags": {
        "adhd": "1.0.0",
        "latest": "1.0.0",
        "neurodivergent": "1.0.0",
        "planning": "1.0.0",
        "productivity": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 160,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 2,
        "versions": 1
      },
      "createdAt": 1769645692244,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769645692244,
        "changelog": "ADHD Daily Planner 1.0.0\n\n- Initial release focused on practical daily planning designed specifically for ADHD brains.\n- Includes realistic time management strategies, dopamine-aware task design, and executive function support.\n- Features flexible daily and weekly planning templates, crisis mode aids, and anti-patterns to avoid shame and overwhelm.\n- Emphasizes buildable routines, working memory supports, and time-blindness accommodations.\n- Provides actionable tools, checklists, and decision trees for everyday use."
      }
    },
    {
      "slug": "exa-web-search-free",
      "displayName": "Exa Web Search (Free)",
      "summary": "Free AI search via Exa MCP. Web search for news/info, code search for docs/examples from GitHub/StackOverflow, company research for business intel. No API key needed.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 480,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 9,
        "versions": 2
      },
      "createdAt": 1769644119080,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769644357484,
        "changelog": "Condensed skill: shorter description (171 chars vs 357), more concise SKILL.md (2.4KB vs 4.5KB). Core functionality unchanged."
      }
    },
    {
      "slug": "home-assistant",
      "displayName": "Home Assistant",
      "summary": "Control Home Assistant smart home devices, run automations, and receive webhook events. Use when controlling lights, switches, climate, scenes, scripts, or any HA entity. Supports bidirectional communication via REST API (outbound) and webhooks (inbound triggers from HA automations).",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 301,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 1
      },
      "createdAt": 1769638965135,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769638965135,
        "changelog": "Initial release: Control HA devices, scenes, scripts via REST API + webhook support"
      }
    },
    {
      "slug": "x-api",
      "displayName": "X Api",
      "summary": "Post to X (Twitter) using the official API with OAuth 1.0a. Use when you need to tweet, post updates, or publish content. Bypasses rate limits and bot detection that affect cookie-based approaches like bird CLI.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 131,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 3,
        "versions": 1
      },
      "createdAt": 1769635911554,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769635911554,
        "changelog": "- Initial release of x-api: post tweets to X (Twitter) using the official API with OAuth 1.0a.\n- Bypasses rate limits and bot detectionÔÇömore reliable than cookie-based CLI tools.\n- Clear setup instructions for obtaining and configuring API credentials.\n- Supports multi-line tweet posts and returns the tweet URL on success.\n- Specifies API usage limits, troubleshooting steps, and distinguishes use cases vs. the bird CLI for reading."
      }
    },
    {
      "slug": "opencode-controller",
      "displayName": "Opencode-controller",
      "summary": "Control and operate Opencode via slash commands. Use this skill to manage sessions, select models, switch agents (plan/build), and coordinate coding through Opencode.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 148,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769633853391,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769633853391,
        "changelog": "opencode-controller 1.0.0\n\n- Initial release.\n- Enables controlling Opencode sessions and workflows via slash commands.\n- Guides users through provider selection, authentication, and session management.\n- Supports agent switching between planning and building modes.\n- Enforces step-by-step planning before any code generation.\n- Ensures all actions and choices are explicit in the output."
      }
    },
    {
      "slug": "para-second-brain",
      "displayName": "PARA Second Brain",
      "summary": "Organize your agent's knowledge using PARA (Projects, Areas, Resources, Archive) ÔÇö then make it ALL searchable. The symlink trick enables full semantic search across your entire knowledge base, not just MEMORY.md. Includes session transcript indexing and memory flush protocol. Your agent finally has a real second brain.",
      "tags": {
        "latest": "2.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 239,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 7
      },
      "createdAt": 1769632065900,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "2.0.1",
        "createdAt": 1769704942488,
        "changelog": "Added PARA explanation to description, credited Tiago Forte as creator of PARA methodology"
      }
    },
    {
      "slug": "proactive-agent",
      "displayName": "Proactive Agent",
      "summary": "Transform AI agents from task-followers into proactive partners that anticipate needs and continuously improve. Includes memory architecture with pre-compaction flush (so context survives when the window fills), reverse prompting (surfaces ideas you didn't know to ask for), security hardening, self-healing patterns (diagnoses and fixes its own issues), and alignment systems (stays on mission, remembers who it serves). Battle-tested patterns for agents that learn from every interaction and create value without being asked.",
      "tags": {
        "latest": "1.2.4"
      },
      "stats": {
        "comments": 0,
        "downloads": 1461,
        "installsAllTime": 5,
        "installsCurrent": 5,
        "stars": 15,
        "versions": 9
      },
      "createdAt": 1769629545209,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.2.4",
        "createdAt": 1769676334799,
        "changelog": "Memory flush: replaced vague 'signs compaction is coming' with concrete threshold-based monitoring via session_status (50/70/85% triggers)"
      }
    },
    {
      "slug": "docker-diag",
      "displayName": "Docker Diag",
      "summary": "Advanced log analysis for Docker containers using signal extraction.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 33,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769626284425,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769626284425,
        "changelog": "Initial release of Docker Pro Diagnostic:\n\n- Provides advanced log analysis for Docker containers using signal extraction.\n- Guides users to extract and analyze logs via a provided Python script.\n- Summarizes probable root causes and suggests relevant fixes for code or resource errors.\n- Offers clear instructions and example usage for troubleshooting failing containers."
      }
    },
    {
      "slug": "env-sync",
      "displayName": "Environment Sync Tool",
      "summary": "Generate .env.example from your .env files. Use when onboarding developers.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 15,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769626245092,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769632441268,
        "changelog": "- Improved documentation with clearer descriptions and usage instructions in SKILL.md.\n- Updated examples and best practices for keeping .env.example in sync.\n- Noted the requirement for the OPENAI_API_KEY environment variable.\n- Clarified support for multiple .env variants and how secrets are handled.\n- Updated project links and streamlined explanations for easier onboarding."
      }
    },
    {
      "slug": "debug-pro",
      "displayName": "Debug Pro",
      "summary": null,
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 22,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769625005426,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769625005426,
        "changelog": "debug-pro 1.0.0 initial release:\n\n- Introduces a detailed 7-step debugging protocol for systematic problem-solving.\n- Provides quick-reference debugging commands for JavaScript/TypeScript, Python, Swift, CSS/layout, network tools, and git bisect.\n- Includes a table of common error messages, their likely causes, and quick fixes.\n- Lists frequently used diagnostic shell commands for system and application troubleshooting."
      }
    },
    {
      "slug": "nocodb",
      "displayName": "NocoDB",
      "summary": "Access and manage NocoDB databases, tables, and records via REST API. Use when the user wants to view bases, list tables, inspect column schemas, query or filter row data, or insert new records into a self-hosted NocoDB instance. Also use for spreadsheet-style database lookups and data entry.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 20,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769624464664,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769624464664,
        "changelog": "Initial release: access and manage NocoDB bases, tables, columns, and rows via REST API"
      }
    },
    {
      "slug": "supermemory",
      "displayName": "Supermemory",
      "summary": "Store and retrieve memories using the SuperMemory API. Add content, search memories, and chat with your knowledge base.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 254,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769623551710,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769623551710,
        "changelog": "Initial release of SuperMemory skill.\n\n- Store, search, and chat with your personal knowledge base using the SuperMemory API.\n- Add content to your memory store with optional descriptions.\n- Search your memories by query.\n- Chat conversationally with your memory database.\n- Simple bash commands for memory management.\n- Requires configuration of the SUPERMEMORY_API_KEY environment variable."
      }
    },
    {
      "slug": "ui-ux-pro-max",
      "displayName": "UI/UX Pro Max",
      "summary": "UI/UX design intelligence and implementation guidance for building polished interfaces. Use when the user asks for UI design, UX flows, information architecture, visual style direction, design systems/tokens, component specs, copy/microcopy, accessibility, or to generate/critique/refine frontend UI (HTML/CSS/JS, React, Next.js, Vue, Svelte, Tailwind). Includes workflows for (1) generating new UI layouts and styling, (2) improving existing UI/UX, (3) producing design-system tokens and component guidelines, and (4) turning UX recommendations into concrete code changes.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 508,
        "installsAllTime": 3,
        "installsCurrent": 3,
        "stars": 4,
        "versions": 1
      },
      "createdAt": 1769616159343,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769616159343,
        "changelog": "Initial Clawdbot packaging from upstream ui-ux-pro-max-skill"
      }
    },
    {
      "slug": "super-websearch-realtime",
      "displayName": "Realtime Web Search",
      "summary": "Priority live web search for real-time information",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 266,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769615484718,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769615484718,
        "changelog": "Initial release: Enables real-time web searching with prioritized live data.\n\n- Uses the `web_search_preview` tool to deliver up-to-date information.\n- Always prefers the most recent and authoritative sources available.\n- Clearly summarizes findings and indicates if information may be incomplete or outdated.\n- Falls back to non-real-time answers if the search tool is unsupported.\n- Responds in the user's language."
      }
    },
    {
      "slug": "reddit-insights",
      "displayName": "Reddit Insights",
      "summary": "Search and analyze Reddit content using semantic AI search via reddit-insights.com MCP server.\nUse when you need to: (1) Find user pain points and frustrations for product ideas, (2) Discover niche markets or underserved needs, (3) Research what people really think about products/topics, (4) Find content inspiration from real discussions, (5) Analyze sentiment and trends on Reddit, (6) Validate business ideas with real user feedback.\nTriggers: reddit search, find pain points, market research, user feedback, what do people think about, reddit trends, niche discovery, product validation.",
      "tags": {
        "latest": "1.2.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 214,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 4
      },
      "createdAt": 1769614370569,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.2.0",
        "createdAt": 1769614982307,
        "changelog": "Major update: Added 10 real-world tested scenarios with exact relevance scores, query formula cheat sheet, best use cases rating, performance benchmarks (12-25s), warnings about weak query patterns"
      }
    },
    {
      "slug": "gold-price-mcp",
      "displayName": "Gold Price Mcp",
      "summary": "Ó©öÓ©ÂÓ©çÓ©úÓ©▓Ó©äÓ©▓Ó©ùÓ©¡Ó©çÓ©äÓ©│Ó©øÓ©▒Ó©êÓ©êÓ©©Ó©ÜÓ©▒Ó©ÖÓ©êÓ©▓Ó©ü api Ó©üÓ©ÑÓ©▓Ó©çÓ©éÓ©¡Ó©çÓ©øÓ©úÓ©░Ó╣ÇÓ©ùÓ©¿Ó╣äÓ©ùÓ©ó",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 33,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769611734291,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769611734291,
        "changelog": "Initial release of gold_price_mcp\n\n- Provides current Thai gold prices (gold ornament and gold bar) with last update time.\n- Uses ThailandÔÇÖs central gold price API as source.\n- Includes tool: mcp_gold_price_mc_get_thai_gold_price."
      }
    },
    {
      "slug": "youtube",
      "displayName": "Youtube",
      "summary": "Search YouTube videos, get channel info, fetch video details and transcripts using YouTube Data API v3 via MCP server or yt-dlp fallback.",
      "tags": {
        "latest": "1.0.1",
        "youtube": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 238,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 3,
        "versions": 2
      },
      "createdAt": 1769611121418,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769621161804,
        "changelog": "- Documentation expanded and clarified in README.md.\n- Additional usage examples, troubleshooting advice, and step-by-step setup instructions included.\n- Security guidance and common workflow sections improved for easier reference."
      }
    },
    {
      "slug": "veo3-video-gen",
      "displayName": "Veo 3 Video Gen (Gemini API)",
      "summary": "Generate and stitch short videos via Google Veo 3.x using the Gemini API (google-genai). Use when you need to create video clips from prompts (ads, UGC-style clips, product demos) and want a reproducible CLI workflow (generate, poll, download MP4, optionally stitch multiple segments).",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 72,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769609324187,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769609324187,
        "changelog": "Initial public release."
      }
    },
    {
      "slug": "css-to-tailwind",
      "displayName": "CSS to Tailwind Converter",
      "summary": "Convert CSS files to Tailwind utility classes. Use when migrating from vanilla CSS to Tailwind.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 21,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769597194954,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769597194954,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "mock-gen",
      "displayName": "Mock Gen",
      "summary": "Generate realistic mock data from descriptions, types, or schemas. Use when you need test data fast.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 12,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769591489550,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769591489550,
        "changelog": "- Initial release of mock-gen.\n- Instantly generates realistic mock data from plain English, TypeScript types, or JSON schemas.\n- Supports output in JSON, CSV, or SQL formats with configurable record counts and direct file output.\n- Ideal for dev databases, frontend prototypes, testing, and demos.\n- Zero configuration requiredÔÇörun via npx with Node.js 18+.\n- Part of the free LXGIC Dev Toolkit."
      }
    },
    {
      "slug": "web-qa-bot",
      "displayName": "Web Qa Bot",
      "summary": "AI-powered web application QA automation using accessibility-tree based testing. Smoke tests, test suites, and PDF reports.",
      "tags": {
        "latest": "0.1.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 39,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769590189001,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.1",
        "createdAt": 1769590436929,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "actual-budget",
      "displayName": "Actual Budget CLI to interact with the Actual Budget API",
      "summary": "Query and manage personal finances via the official Actual Budget Node.js API. Use for budget queries, transaction imports/exports, account management, categorization, rules, schedules, and bank sync with self-hosted Actual Budget instances.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 83,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769583773401,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769585816231,
        "changelog": "- Expanded documentation from CLI tool usage to **official Node.js API usage**\n- Updated environment variables and setup instructions for clarity and additional options.\n- Added code examples for all major financial operations (budget overview, account/transaction/category/payee management, rules, schedules, sync).\n- Introduced ActualQL query support with example queries and available operators.\n- Included advanced topics: handling transfers, split transactions, and bulk imports for new budgets.\n- Linked to full API and query language documentation for further reference. usi"
      }
    },
    {
      "slug": "ffmpeg-cli",
      "displayName": "FFmpeg CLI",
      "summary": null,
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 79,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769579607401,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769579607401,
        "changelog": "Initial release: comprehensive video/audio processing with cut, merge, extract-audio, thumb, gif, convert, speed, watermark scripts"
      }
    },
    {
      "slug": "telegram-compose",
      "displayName": "Telegram Compose",
      "summary": "Compose rich, readable Telegram messages using HTML formatting via direct Telegram API.\nUse when: (1) Sending any Telegram message beyond a simple one-line reply,\n(2) Creating structured messages with sections, lists, or status updates,\n(3) Need formatting unavailable via Clawdbot's Markdown conversion (underline, spoilers, expandable blockquotes, user mentions by ID),\n(4) Sending alerts, reports, summaries, or notifications to Telegram,\n(5) Want professional, scannable message formatting with visual hierarchy.\nDefault to this skill for substantive Telegram communication.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 98,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769575509137,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769575509137,
        "changelog": "Initial release of telegram-compose ÔÇö a skill for composing rich, structured Telegram messages via direct API with advanced HTML formatting.\n\n- Provides example commands and configuration steps for sending messages with HTML tags.\n- Details available HTML formatting options, including headings, expandable blockquotes, user mentions by ID, and spoilers.\n- Supplies clear structural and stylistic guidelines for professional, scannable messaging.\n- Outlines use cases, message limits, and decision criteria for when to use direct API over ClawdbotÔÇÖs Markdown conversion.\n- Includes practical message templates for alerts, status updates, and lists."
      }
    },
    {
      "slug": "memory-setup",
      "displayName": "Memory Setup",
      "summary": "Enable and configure Moltbot/Clawdbot memory search for persistent context. Use when setting up memory, fixing \"goldfish brain,\" or helping users configure memorySearch in their config. Covers MEMORY.md, daily logs, and vector search setup.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 1036,
        "installsAllTime": 3,
        "installsCurrent": 3,
        "stars": 7,
        "versions": 1
      },
      "createdAt": 1769568045678,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769568045678,
        "changelog": "Initial release: Complete guide to enabling and configuring Moltbot/Clawdbot memory search. Covers config, file structure, daily logs, and troubleshooting. Turn your agent from goldfish to elephant."
      }
    },
    {
      "slug": "search-reddit",
      "displayName": "Search Reddit",
      "summary": "Search Reddit in real time using OpenAI web_search with enrichment (engagement + top comments). Use when you need recent Reddit threads, subreddit-filtered results, or quick link lists.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 72,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769554687836,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769554687836,
        "changelog": "Initial release: search-x style Reddit search + enrichment (score/comments/top comments), filters, links-only/compact/json output."
      }
    },
    {
      "slug": "anyone-proxy",
      "displayName": "Anyone Procotol Proxy",
      "summary": "This skill enables IP address masking and accessing hidden services on the Anyone Network. Route requests through the Anyone Protocol VPN network using a local SOCKS5 proxy.",
      "tags": {
        "anyone": "0.1.0",
        "anyone-protocol": "0.1.0",
        "latest": "0.1.0",
        "proxy": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 28,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 5
      },
      "createdAt": 1769554573134,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769636076129,
        "changelog": "- Removed package.json and package-lock.json files.\n- The skill documentation and core functionality remain unchanged."
      }
    },
    {
      "slug": "reddit-scraper",
      "displayName": "Reddit Scraper",
      "summary": "Read and search Reddit posts via web scraping of old.reddit.com. Use when Clawdbot needs to browse Reddit content - read posts from subreddits, search for topics, monitor specific communities. Read-only access with no posting or comments.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 233,
        "installsAllTime": 3,
        "installsCurrent": 3,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769552693110,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769552693110,
        "changelog": "Initial release: JSON API, search, short links, flairs"
      }
    },
    {
      "slug": "todoist-rs",
      "displayName": "todoist latest",
      "summary": "Manage Todoist tasks. Use when the user mentions \"todoist\", \"my tasks\", \"task list\", \"add a task\", \"complete task\", or wants to interact with their Todoist account.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 36,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 2
      },
      "createdAt": 1769552164960,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769552671529,
        "changelog": "- Added `homepage` field with the project GitHub link.\n- Included detailed skill metadata for installation and requirements.\n- No changes to functionality or usage instructions."
      }
    },
    {
      "slug": "serpapi-search",
      "displayName": "SerpAPI Search",
      "summary": "Search Google via SerpAPI (Google Search, Google News, Google Local). Use when you need to search the web, find news articles, or look up local businesses. Supports country/language targeting for region-specific results.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 60,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769551263414,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769551263414,
        "changelog": "Initial release: Google Search, Google News, Google Local with country/language targeting"
      }
    },
    {
      "slug": "x-trends",
      "displayName": "X Trends",
      "summary": "Fetches current top trending topics on X (Twitter) for any country using public aggregators.",
      "tags": {
        "latest": "1.2.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 583,
        "installsAllTime": 6,
        "installsCurrent": 6,
        "stars": 4,
        "versions": 4
      },
      "createdAt": 1769550487398,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.2.1",
        "createdAt": 1769551790248,
        "changelog": "- Updated package-lock.json to maintain dependency consistency.\n- No feature or documentation changes."
      }
    },
    {
      "slug": "firecrawl-search",
      "displayName": "Firecrawl Search",
      "summary": "Web search and scraping via Firecrawl API. Use when you need to search the web, scrape websites (including JS-heavy pages), crawl entire sites, or extract structured data from web pages. Requires FIRECRAWL_API_KEY environment variable.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 246,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769544521483,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769544521483,
        "changelog": "Web search and scraping via Firecrawl API"
      }
    },
    {
      "slug": "deep-research",
      "displayName": "Deep Research Agent",
      "summary": "Deep Research Agent specializes in complex, multi-step research tasks that require planning, decomposition, and long-context reasoning across tools and files by we-crafted.com/agents/deep-research",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 1314,
        "installsAllTime": 4,
        "installsCurrent": 3,
        "stars": 9,
        "versions": 2
      },
      "createdAt": 1769540388277,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769615567637,
        "changelog": "- Updated MCP server endpoint in configuration to http://bore.pub:44876\n- No other user-facing or functional changes detected"
      }
    },
    {
      "slug": "binance",
      "displayName": "Binance",
      "summary": "Binance exchange integration. Trade spot, futures, and manage portfolio on the world's largest crypto exchange.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 182,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 2
      },
      "createdAt": 1769539506029,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769539949297,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "postgres",
      "displayName": "PostgreSQL",
      "summary": "PostgreSQL database management. Run queries, manage schemas, and monitor performance.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 183,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769537311687,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769540944232,
        "changelog": "- Updated requirements to include \"curl\" and \"jq\" binaries in addition to \"psql\".\n- Added \"always\": true to metadata for enhanced skill availability."
      }
    },
    {
      "slug": "redis",
      "displayName": "Redis",
      "summary": "Redis database management. Key-value operations, caching, pub/sub, and data structure commands.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 67,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769537188686,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769540942633,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "context-manager",
      "displayName": "Smart Context Manager",
      "summary": "AI-powered context management for Clawdbot/Moltbot sessions",
      "tags": {
        "latest": "1.0.0-b",
        "latest-beta": "1.0.0-b"
      },
      "stats": {
        "comments": 0,
        "downloads": 52,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 2,
        "versions": 1
      },
      "createdAt": 1769537087447,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0-b",
        "createdAt": 1769537087447,
        "changelog": "- Initial release of context-manager skill for Clawdbot/Moltbot.\n- Adds AI-powered session summarization and compression with backup and restore.\n- Includes CLI commands to list, check, summarize, and compress session context.\n- Backs up original session data before destructive actions.\n- Summarization uses the agent itself for accurate and context-aware results."
      }
    },
    {
      "slug": "database",
      "displayName": "Database",
      "summary": "Database management and queries. Connect to SQL and NoSQL databases, run queries, and manage schemas.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 192,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 2
      },
      "createdAt": 1769537008226,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769540954062,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "youtube-transcript",
      "displayName": "YouTube Transcript",
      "summary": "Fetch and summarize YouTube video transcripts. Use when asked to summarize, transcribe, or extract content from YouTube videos. Handles transcript fetching via residential IP proxy to bypass YouTube's cloud IP blocks.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 655,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 3,
        "versions": 2
      },
      "createdAt": 1769530656679,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769532361984,
        "changelog": "Initial public release"
      }
    },
    {
      "slug": "notion-skill",
      "displayName": "Notion",
      "summary": "Work with Notion pages and databases via the official Notion API.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 140,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769524433792,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769524433792,
        "changelog": "Initial release of the Notion skill:\n\n- Provides commands to interact with Notion pages and databases via the official Notion API.\n- Supports reading, creating, and updating pages and database rows using a local `notion-cli` tool.\n- Documents safe usage patterns, including handling profiles and authentication via `NOTION_API_KEY`.\n- Includes guidance on inspecting and updating database schemas.\n- Emphasizes safety: prefer appending/updating, always inspect diffs before schema changes, and respect rate limits."
      }
    },
    {
      "slug": "skill-creator",
      "displayName": "Skill Creator",
      "summary": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Claude's capabilities with specialized knowledge, workflows, or tool integrations.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 724,
        "installsAllTime": 31,
        "installsCurrent": 31,
        "stars": 6,
        "versions": 1
      },
      "createdAt": 1769522677376,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769522677376,
        "changelog": "Initial release of skill-creator, a comprehensive guide for designing modular skills to extend ClaudeÔÇÖs capabilities.\n\n- Introduces principles for creating effective, concise, and domain-specific skills.\n- Explains modular structure: required SKILL.md and optional scripts, references, and assets folders.\n- Outlines guidelines for what to include (and exclude) in a skill package.\n- Details progressive disclosure design for efficient context management.\n- Provides reference patterns for organizing content and bundling resources."
      }
    },
    {
      "slug": "yt-dlp-downloader-skill",
      "displayName": "Yt Dlp Downloader",
      "summary": "Download videos from YouTube, Bilibili, Twitter, and thousands of other sites using yt-dlp. Use when the user provides a video URL and wants to download it, extract audio (MP3), download subtitles, or select video quality. Triggers on phrases like \"õ©ïÞ¢¢ÞºåÚóæ\", \"download video\", \"yt-dlp\", \"YouTube\", \"Bþ½Ö\", \"µèûÚƒ│\", \"µÅÉÕÅûÚƒ│Úóæ\", \"extract audio\".",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 305,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769515135889,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769515135889,
        "changelog": "Initial release of yt-dlp-downloader-skill.\n\n- Enables video and audio downloads from YouTube, Bilibili, Twitter, TikTok, and thousands of other sites using yt-dlp.\n- Supports downloading best quality video, extracting audio as MP3, downloading subtitles, and selecting video quality.\n- Provides command examples and troubleshooting guidance for common errors (e.g., YouTube 403 errors, missing dependencies).\n- Workflow adapts commands based on user needs and source platform (e.g., always using browser cookies for YouTube).\n- Triggers on multi-language keywords such as \"õ©ïÞ¢¢ÞºåÚóæ\", \"download video\", \"extract audio\", \"Bþ½Ö\", and \"µèûÚƒ│\"."
      }
    },
    {
      "slug": "todo",
      "displayName": "Todo",
      "summary": "Task and todo list management. Create, organize, and track tasks with priorities and due dates.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 379,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 3,
        "versions": 2
      },
      "createdAt": 1769514510513,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769540943858,
        "changelog": "- The \"always\" flag was added to the skill metadata, indicating the skill should always be available or active."
      }
    },
    {
      "slug": "calendar",
      "displayName": "Calendar",
      "summary": "Calendar management and scheduling. Create events, manage meetings, and sync across calendar providers.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 1024,
        "installsAllTime": 10,
        "installsCurrent": 10,
        "stars": 5,
        "versions": 1
      },
      "createdAt": 1769514424060,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769514424060,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "email",
      "displayName": "Email",
      "summary": "Email management and automation. Send, read, search, and organize emails across multiple providers.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 897,
        "installsAllTime": 8,
        "installsCurrent": 8,
        "stars": 5,
        "versions": 2
      },
      "createdAt": 1769514343850,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769540911817,
        "changelog": "- Added the \"always\": true flag to the skill metadata for improved default availability.\n- No changes to features or usage."
      }
    },
    {
      "slug": "instagram",
      "displayName": "Instagram",
      "summary": "Instagram platform integration. Post content, manage stories, view insights, and engage with followers.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 277,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 3,
        "versions": 2
      },
      "createdAt": 1769514107246,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769540905419,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "twitter",
      "displayName": "Twitter",
      "summary": "Twitter/X platform integration. Post tweets, read timeline, manage followers, and analyze engagement.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 366,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 2
      },
      "createdAt": 1769513967558,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769540906640,
        "changelog": "- Metadata updated to include \"always\": true for consistent skill availability.\n- Removed \"env\" list from required environment variables in metadata."
      }
    },
    {
      "slug": "stripe",
      "displayName": "Stripe",
      "summary": "Stripe payment platform integration. Manage payments, subscriptions, invoices, and customers via Stripe API.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 81,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769513798424,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769539209931,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "paypal",
      "displayName": "PayPal",
      "summary": "PayPal payment integration. Send money, create invoices, and manage PayPal transactions.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 31,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769513689168,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769539982840,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "heurist-mesh",
      "displayName": "Heurist Mesh Crypto Analysis Skill",
      "summary": "Access Web3 and crypto intelligence via Heurist Mesh MCP. Use when the user asks about cryptocurrency analytics, token information, trending tokens, wallet analysis, Twitter/X crypto intelligence, funding rates, market summaries, or any Web3-related queries. Heurist Mesh provides 30+ specialized AI agents for crypto use cases through the mcporter CLI.",
      "tags": {
        "latest": "1.0.2"
      },
      "stats": {
        "comments": 3,
        "downloads": 472,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 7,
        "versions": 3
      },
      "createdAt": 1769510010995,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.2",
        "createdAt": 1769620308307,
        "changelog": "- Added detailed instructions for using \"Ask Heurist,\" a new crypto Q&A and research agent"
      }
    },
    {
      "slug": "byterover",
      "displayName": "ByteRover",
      "summary": "Manages project knowledge using ByteRover context tree. Provides two operations: query (retrieve knowledge) and curate (store knowledge). Invoke when user requests information lookup, pattern discovery, or knowledge persistence. Developed by ByteRover Inc. (https://byterover.dev/)",
      "tags": {
        "latest": "1.2.2"
      },
      "stats": {
        "comments": 0,
        "downloads": 14073,
        "installsAllTime": 3,
        "installsCurrent": 3,
        "stars": 20,
        "versions": 2
      },
      "createdAt": 1769508805216,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.2.2",
        "createdAt": 1769526352095,
        "changelog": "- Added author and version metadata to the SKILL.md file.\n- Updated description to include developer attribution and website link: ByteRover Inc. (https://byterover.dev/).\n- No changes to functionality or file structure."
      }
    },
    {
      "slug": "news-aggregator-skill-2",
      "displayName": "News Aggregator Skill",
      "summary": "Comprehensive news aggregator that fetches, filters, and deeply analyzes real-time content from 8 major sources: Hacker News, GitHub Trending, Product Hunt, 36Kr, Tencent News, WallStreetCN, V2EX, and Weibo. Best for 'daily scans', 'tech news briefings', 'finance updates', and 'deep interpretations' of hot topics.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 138,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769506445421,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769506445421,
        "changelog": "Initial release of News Aggregator Skill.\n\n- Fetches and deeply analyzes real-time news from 8 major sources (Hacker News, GitHub Trending, Product Hunt, 36Kr, Tencent News, WallStreetCN, V2EX, Weibo).\n- Supports both broad \"Global Scan\" and targeted keyword searches with automatic keyword expansion for domain coverage.\n- Adds deep fetching mode (`--deep`) to extract and include full article content.\n- Implements smart time filtering and annotated \"smart fill\" for sparse results, ensuring rich reports.\n- Provides interactive menu/help system triggered by specific user commands.\n- Generates concise, structured magazine-style reports in Chinese, saving each session's report to the `reports/` directory."
      }
    },
    {
      "slug": "anshumanbh-qmd",
      "displayName": "QMD Search",
      "summary": "Search markdown knowledge bases efficiently using qmd. Use this when searching Obsidian vaults or markdown collections to find relevant content with minimal token usage.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 22,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769500172640,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769500172640,
        "changelog": "Initial release - efficient markdown knowledge base search using qmd"
      }
    },
    {
      "slug": "ai-pdf-builder",
      "displayName": "Ai Pdf Builder",
      "summary": "Generate professional PDFs from Markdown using Pandoc and LaTeX with AI-powered content generation. Creates whitepapers, term sheets, memos, agreements, SAFEs, NDAs, and more.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 226,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 2
      },
      "createdAt": 1769499942443,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769527084530,
        "changelog": "Added AI content generation, --company flag, content sanitization"
      }
    },
    {
      "slug": "feishu-bridge",
      "displayName": "Feishu Bridge",
      "summary": "Connect a Feishu (Lark) bot to Clawdbot via WebSocket long-connection. No public server, domain, or ngrok required. Use when setting up Feishu/Lark as a messaging channel, troubleshooting the Feishu bridge, or managing the bridge service (start/stop/logs). Covers bot creation on Feishu Open Platform, credential setup, bridge startup, macOS launchd auto-restart, and group chat behavior tuning.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 220,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769499526377,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769499526377,
        "changelog": "Initial release: Feishu/Lark bot to Clawdbot bridge via WebSocket"
      }
    },
    {
      "slug": "youtube-title-generator",
      "displayName": "YouTube Title Generator",
      "summary": "Generates compelling YouTube title ideas from content concepts. Use when someone needs click-worthy video titles using proven structural formulas and psychological patterns from high-performing videos.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 36,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769496258154,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769496258154,
        "changelog": "- Initial release of YouTube Title Generator skill.\n- Generates 30 compelling YouTube title ideas (20 structured + 10 creative) from user-provided concepts.\n- Uses proven structural formulas and psychological triggers derived from high-performing YouTube titles.\n- Loads reference patterns from an optional file to optimize title performance.\n- Saves generated titles and analysis to timestamped files, with clear workflow and error handling.\n- Includes constraints for title character length, originality, tone, and distinctiveness."
      }
    },
    {
      "slug": "browser-ladder",
      "displayName": "Browser Ladder",
      "summary": "Climb the browser ladder ÔÇö start free, escalate only when needed. L1 (fetch) ÔåÆ L2 (local Playwright) ÔåÆ L3 (BrowserCat) ÔåÆ L4 (Browserless.io for CAPTCHA/bot bypass).",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 26,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769489692629,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769489692629,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "yt-api-cli",
      "displayName": "YouTube API CLI",
      "summary": "Manage your YouTube account from the command line. Complete CLI for YouTube Data API v3 - list/search videos, upload, manage playlists, and more.",
      "tags": {
        "latest": "1.0.2"
      },
      "stats": {
        "comments": 0,
        "downloads": 84,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 3
      },
      "createdAt": 1769484534363,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.2",
        "createdAt": 1769484803621,
        "changelog": "Initial release"
      }
    },
    {
      "slug": "salesforce",
      "displayName": "Salesforce Skill",
      "summary": "Query and manage Salesforce CRM data via the Salesforce CLI (`sf`). Run SOQL/SOSL queries, inspect object schemas, create/update/delete records, bulk import/export, execute Apex, deploy metadata, and make raw REST API calls.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 32,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769484075138,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769484075138,
        "changelog": "Initial release: comprehensive Salesforce CLI (sf) skill covering SOQL/SOSL queries, record CRUD, bulk operations, Apex execution, REST API, metadata deployment, and schema inspection."
      }
    },
    {
      "slug": "searxng",
      "displayName": "Searxng",
      "summary": "Privacy-respecting metasearch using your local SearXNG instance. Search the web, images, news, and more without external API dependencies.",
      "tags": {
        "latest": "1.0.3"
      },
      "stats": {
        "comments": 0,
        "downloads": 268,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 1,
        "versions": 4
      },
      "createdAt": 1769472352291,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.3",
        "createdAt": 1769472992634,
        "changelog": "Latest updates with improved documentation"
      }
    },
    {
      "slug": "clawdbot-security-suite",
      "displayName": "Clawdbot Security Suite",
      "summary": "Advanced security validation for Clawdbot - pattern detection, command sanitization, and threat monitoring",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 180,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 6,
        "versions": 1
      },
      "createdAt": 1769471336469,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769471336469,
        "changelog": "­ƒöÆ Initial release: Comprehensive AI agent security\n\nFeatures:\nÔÇó 50+ threat detection patterns from security research\nÔÇó Command injection, SSRF, path traversal protection\nÔÇó Prompt injection and API key exposure detection\nÔÇó Real-time security monitoring and event logging\nÔÇó Manual integration + automatic hooks\nÔÇó Complete documentation and examples\n\nBuilt for Clawdbot with plans to expand to other AI agents."
      }
    },
    {
      "slug": "geo-optimization",
      "displayName": "GEO Optimization",
      "summary": "Generative Engine Optimization (GEO) for AI search visibility. Optimize content to appear in ChatGPT, Perplexity, Claude, and Google AI Overviews. Use when optimizing websites, pages, or content for LLM discoverability and citation.",
      "tags": {
        "latest": "1.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 109,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 3,
        "versions": 2
      },
      "createdAt": 1769471078659,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769554474692,
        "changelog": "Added automated monitoring tools: geo-monitor.py for testing citation rates, geo-daily-report.py for formatted reports, and example query file for tracking AI search visibility over time"
      }
    },
    {
      "slug": "security-monitor",
      "displayName": "Security Monitor",
      "summary": "Real-time security monitoring for Clawdbot. Detects intrusions, unusual API calls, credential usage patterns, and alerts on breaches.",
      "tags": {
        "intrusion-detection": "1.0.0",
        "latest": "1.0.0",
        "monitoring": "1.0.0",
        "realtime": "1.0.0",
        "security": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 202,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769467400470,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769467400470,
        "changelog": "Initial release: brute force detection, port anomaly monitoring, process monitoring, file change detection, Docker health checks"
      }
    },
    {
      "slug": "security-audit",
      "displayName": "Security Audit",
      "summary": "Comprehensive security auditing for Clawdbot deployments. Scans for exposed credentials, open ports, weak configs, and vulnerabilities. Auto-fix mode included.",
      "tags": {
        "audit": "1.0.0",
        "latest": "1.0.0",
        "scanning": "1.0.0",
        "security": "1.0.0",
        "vulnerabilities": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 236,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 1
      },
      "createdAt": 1769467312547,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769467312547,
        "changelog": "Initial release: credential scanning, port detection, config validation, file permissions, Docker security checks, auto-fix mode"
      }
    },
    {
      "slug": "youtube-analytics",
      "displayName": "YouTube Analytics",
      "summary": "YouTube Data API v3 analytics toolkit. Analyze YouTube channels, videos, and search results. Use when the user asks to: check YouTube channel stats, analyze video performance, compare channels, search for videos, get subscriber counts, view engagement metrics, find trending videos, get channel uploads, or analyze YouTube competition. Requires a YouTube Data API v3 key from Google Cloud Console.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 73,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769465352916,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769465352916,
        "changelog": "Initial release ÔÇö YouTube Data API v3 toolkit for channel analytics, video analysis, and search"
      }
    },
    {
      "slug": "ga4-analytics",
      "displayName": "GA4 Analytics",
      "summary": "Google Analytics 4, Search Console, and Indexing API toolkit. Analyze website traffic, page performance, user demographics, real-time visitors, search queries, and SEO metrics. Use when the user asks to: check site traffic, analyze page views, see traffic sources, view user demographics, get real-time visitor data, check search console queries, analyze SEO performance, request URL re-indexing, inspect index status, compare date ranges, check bounce rates, view conversion data, or get e-commerce revenue. Requires a Google Cloud service account with GA4 and Search Console access.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 148,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769464446311,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769464446311,
        "changelog": "Initial release ÔÇö GA4 Analytics, Search Console, and Indexing API toolkit with 30+ functions"
      }
    },
    {
      "slug": "clawdbot-security-check",
      "displayName": "Clawdbot Security Check",
      "summary": "Perform a comprehensive read-only security audit of Clawdbot's own configuration. This is a knowledge-based skill that teaches Clawdbot to identify hardening opportunities across the system. Use when user asks to \"run security check\", \"audit clawdbot\", \"check security hardening\", or \"what vulnerabilities does my Clawdbot have\". This skill uses Clawdbot's internal capabilities and file system access to inspect configuration, detect misconfigurations, and recommend remediations. It is designed to be extensible - new checks can be added by updating this skill's knowledge.",
      "tags": {
        "latest": "2.2.2"
      },
      "stats": {
        "comments": 18,
        "downloads": 854,
        "installsAllTime": 6,
        "installsCurrent": 6,
        "stars": 7,
        "versions": 5
      },
      "createdAt": 1769463345220,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "2.2.2",
        "createdAt": 1769469026784,
        "changelog": "Added Trust Hierarchy, Prompt Injection Mitigation, Sandboxing levels, Browser Control Risks, Incident Response, Secret Scanning, Vulnerability Reporting. 13 domains."
      }
    },
    {
      "slug": "gcal-pro",
      "displayName": "gcal-pro - Google Calendar",
      "summary": "Google Calendar integration for viewing, creating, and managing calendar events. Use when the user asks about their schedule, wants to add/edit/delete events, check availability, or needs a morning brief. Supports natural language like \"What's on my calendar tomorrow?\" or \"Schedule lunch with Alex at noon Friday.\" Free tier provides read access; Pro tier ($12) adds create/edit/delete and morning briefs.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 114,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769462641485,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769462641485,
        "changelog": "Initial release"
      }
    },
    {
      "slug": "google-workspace-mcp",
      "displayName": "Google Workspace (No Cloud Console)",
      "summary": "Gmail, Calendar, Drive, Docs, Sheets ÔÇö NO Google Cloud Console required. Just OAuth sign-in. Zero setup complexity vs traditional Google API integrations.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 2,
        "downloads": 1046,
        "installsAllTime": 8,
        "installsCurrent": 8,
        "stars": 14,
        "versions": 1
      },
      "createdAt": 1769458839920,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769458839920,
        "changelog": "Initial release of Google Workspace skill with zero setup complexity:\n\n- Access Gmail, Calendar, Drive, Docs, Sheets, Slides, Chat, and more ÔÇö no Google Cloud Console required, just OAuth sign-in.\n- Install and configure instantly with a single command; credentials managed automatically.\n- Includes 49 tools for searching, reading, creating, updating, and sending within all major Google Workspace apps.\n- Simple troubleshooting and re-authentication workflows provided.\n- Example commands for common actions included in documentation."
      }
    },
    {
      "slug": "claude-code-wingman",
      "displayName": "Claude Code Wingman",
      "summary": "Your Claude Code wingman - orchestrate multiple Claude Code sessions across projects, monitor them all from WhatsApp",
      "tags": {
        "latest": "0.3.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 177,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 3,
        "versions": 3
      },
      "createdAt": 1769458104096,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.3.0",
        "createdAt": 1769551049108,
        "changelog": "**Major update: Multi-session orchestration and robust WhatsApp control.**\n\n- Adds orchestration for multiple Claude Code sessions across different projects.\n- New approval command handling via WhatsApp: instantly processes approve/deny/always commands per session.\n- Includes dashboard and session monitoring scripts for real-time status and management.\n- Changes command/interaction philosophy to always use the wingman script for all session communication.\n- Expands on requirements, installation, usage examples, and introduces foundation for a multi-session dashboard.\n- Updates documentation to reflect new capabilities and workflows."
      }
    },
    {
      "slug": "discord-voice",
      "displayName": "Discord Voice",
      "summary": "Real-time voice conversations in Discord voice channels with Claude AI",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 96,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769456717738,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769456717738,
        "changelog": "Initial release"
      }
    },
    {
      "slug": "atxp",
      "displayName": "ATXP",
      "summary": "Access ATXP paid API tools for web search, AI image generation, music creation, video generation, and X/Twitter search. Use when users need real-time web search, AI-generated media (images, music, video), or X/Twitter search. Requires authentication via `npx atxp login`.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 4380,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 1
      },
      "createdAt": 1769456157744,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769456157744,
        "changelog": "Initial release: web search, image gen, music gen, video gen, X search"
      }
    },
    {
      "slug": "notion-api",
      "displayName": "Notion API Tools",
      "summary": "Generic Notion API CLI (Node) for search, querying data sources (databases), and creating pages. Configure with NOTION_KEY (or ~/.config/notion/api_key).",
      "tags": {
        "WRWC": "1.1.0",
        "latest": "1.1.0",
        "timenotspace": "1.1.0"
      },
      "stats": {
        "comments": 1,
        "downloads": 70,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 2
      },
      "createdAt": 1769455872686,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.0",
        "createdAt": 1769548782805,
        "changelog": "- Updated Notion API version header to default to 2025-09-03.\n- Documentation improvements and minor clarifications in SKILL.md."
      }
    },
    {
      "slug": "financial-market-analysis",
      "displayName": "Financial Market Analysis",
      "summary": "Precision Financial Insights - Analyze stocks, companies, and market sentiment using authoritative data. Powered by Yahoo Finance and enhanced with intelligent news synthesis by we-crafted.com/agents/financial-market-analysis - Buy CRAFTED_API_KEY in our website to start using",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 359,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769455404315,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769455404315,
        "changelog": "Financial Market Analysis"
      }
    },
    {
      "slug": "ytmusic",
      "displayName": "YouTube Music",
      "summary": "Manage YouTube Music library, playlists, and discovery via ytmusicapi.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 48,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 2
      },
      "createdAt": 1769451656815,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769451932469,
        "changelog": "Changed display name."
      }
    },
    {
      "slug": "ralph-loop",
      "displayName": "Ralph Loop",
      "summary": "Generate copy-paste bash scripts for Ralph Wiggum/AI agent loops (Codex, Claude Code, OpenCode, Goose). Use when asked for a ÔÇ£Ralph loopÔÇØ, ÔÇ£Ralph Wiggum loopÔÇØ, or an AI loop to plan/build code via PROMPT.md + AGENTS.md, SPECS, and IMPLEMENTATION_PLAN.md, including PLANNING vs BUILDING modes, backpressure, sandboxing, and completion conditions.",
      "tags": {
        "latest": "0.1.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 110,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 5,
        "versions": 2
      },
      "createdAt": 1769448941407,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.1",
        "createdAt": 1769450187294,
        "changelog": "Align skill with Ralph playbook: specs + planning/building modes, PROMPT/AGENTS/IMPLEMENTATION_PLAN, backpressure, sandbox guidance."
      }
    },
    {
      "slug": "reflect-learn",
      "displayName": "Reflect",
      "summary": "Self-improvement through conversation analysis. Extracts learnings from corrections and success patterns, permanently encoding them into agent definitions. Philosophy - Correct once, never again.",
      "tags": {
        "latest": "2.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 251,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769445465505,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "2.0.0",
        "createdAt": 1769445465505,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "remember-all-prompts-daily",
      "displayName": "Remember All Prompts Daily",
      "summary": "Preserve conversation continuity across token compaction cycles by extracting and archiving all prompts with date-wise entries. Automatically triggers at 95% token usage (pre-compaction) and 1% (new sprint start) to export session history, then ingests archived summaries on session restart to restore context.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 67,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769445380098,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769445428408,
        "changelog": "Initial release: Auto-archive prompts at 95% token usage, ingest at 1% for continuous context preservation"
      }
    },
    {
      "slug": "grok-search",
      "displayName": "grok-search",
      "summary": "Search the web or X/Twitter using xAI Grok server-side tools (web_search, x_search) via the xAI Responses API. Use when you need tweets/threads/users from X, want Grok as an alternative to Brave, or you need structured JSON + citations.",
      "tags": {
        "latest": "0.2.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 225,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 2,
        "versions": 3
      },
      "createdAt": 1769439975447,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.2.1",
        "createdAt": 1769443868217,
        "changelog": "Fix: better citations (dedupe by tweet id, prioritize result URLs, cap size) + keep JSON stable."
      }
    },
    {
      "slug": "elevenlabs-agents",
      "displayName": "ElevenLabs Agents",
      "summary": "Create, manage, and deploy ElevenLabs conversational AI agents. Use when the user wants to work with voice agents, list their agents, create new ones, or manage agent configurations.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 94,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769438645891,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769438645891,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "arxiv-watcher",
      "displayName": "ArXiv Watcher",
      "summary": "Search and summarize papers from ArXiv. Use when the user asks for the latest research, specific topics on ArXiv, or a daily summary of AI papers.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 195,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769434876997,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769434876997,
        "changelog": "Search and summarize ArXiv papers with local research logging."
      }
    },
    {
      "slug": "k8s-browser",
      "displayName": "Kubernetes Skills",
      "summary": "Browser automation for Kubernetes dashboards and web UIs. Use when interacting with Kubernetes Dashboard, Grafana, ArgoCD UI, or other web interfaces. Requires MCP_BROWSER_ENABLED=true.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 29,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769433533790,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769433533790,
        "changelog": "- Initial release of k8s-browser skill for automating Kubernetes dashboards and web UIs.\n- Provides 26 browser automation tools for navigating, interacting, and capturing screenshots of Kubernetes Dashboard, Grafana, ArgoCD UI, and similar interfaces.\n- Requires enabling browser features with MCP_BROWSER_ENABLED=true.\n- Includes example workflows for Kubernetes Dashboard, Grafana, and ArgoCD UI automation.\n- Supports session management, device emulation, and advanced selectors for clicks and form fills."
      }
    },
    {
      "slug": "playwright-cli",
      "displayName": "playwright-cli",
      "summary": "Browser automation via Playwright CLI. Open pages, interact with elements, take screenshots, and more. Ideal for coding agents and automated testing workflows.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 437,
        "installsAllTime": 4,
        "installsCurrent": 4,
        "stars": 1,
        "versions": 2
      },
      "createdAt": 1769431262754,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769432940976,
        "changelog": "Fix: remove macOS-only note (cross-platform)"
      }
    },
    {
      "slug": "linkedin-inbox",
      "displayName": "LinkedIn Inbox Manager",
      "summary": "LinkedIn inbox management with scheduled scanning, auto-draft responses following user's communication style, and approval workflows. Use when monitoring LinkedIn messages, drafting replies, managing inbox during off-hours, or setting up morning ping summaries of LinkedIn activity.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 61,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769430517363,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769430517363,
        "changelog": "Initial release: Peekaboo-based inbox scanning, auto-draft responses matching user communication style, approval workflows, morning ping integration"
      }
    },
    {
      "slug": "gemini-yt-video-transcript",
      "displayName": "Gemini YouTube Video Transcript",
      "summary": "Create a verbatim transcript for a YouTube URL using Google Gemini (speaker labels, paragraph breaks; no time codes). Use when the user asks to transcribe a YouTube video or wants a clean transcript (no timestamps).",
      "tags": {
        "latest": "1.0.2"
      },
      "stats": {
        "comments": 0,
        "downloads": 137,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 3
      },
      "createdAt": 1769424226178,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.2",
        "createdAt": 1769430058543,
        "changelog": "Remove --debug; default output to workspace out/; README explains file_url ingestion"
      }
    },
    {
      "slug": "last30days-lite",
      "displayName": "Last 30 Days (Lite)",
      "summary": "Research any topic across Reddit, X/Twitter, and the web from the last 30 days. Synthesizes findings into actionable insights or copy-paste prompts.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 118,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769411600187,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769411600187,
        "changelog": "Initial release - research any topic across Reddit, X, and web from the last 30 days. No extra API keys needed."
      }
    },
    {
      "slug": "reddit-read-only",
      "displayName": "Reddit (read only - no auth)",
      "summary": "Browse and search Reddit in read-only mode using public JSON endpoints. Use when the user asks to browse subreddits, search for posts by topic, inspect comment threads, or build a shortlist of links to review and reply to manually.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 294,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 3,
        "versions": 1
      },
      "createdAt": 1769403873423,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769403873423,
        "changelog": "Get Reddit posts and comments without auth. Read only."
      }
    },
    {
      "slug": "youtube-summarizer",
      "displayName": "YouTube Summarizer",
      "summary": "Automatically fetch YouTube video transcripts, generate structured summaries, and send full transcripts to messaging platforms. Detects YouTube URLs and provides metadata, key insights, and downloadable transcripts.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 454,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 3,
        "versions": 1
      },
      "createdAt": 1769398410293,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769398410293,
        "changelog": "Initial release - auto-fetch transcripts, generate structured summaries, and send to Telegram"
      }
    },
    {
      "slug": "brave-images",
      "displayName": "Brave Images",
      "summary": "Search for images using Brave Search API. Use when you need to find images, pictures, photos, or visual content on any topic. Requires BRAVE_API_KEY environment variable.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 81,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 3,
        "versions": 2
      },
      "createdAt": 1769393700949,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769393772729,
        "changelog": "Added delivery guidance for showing images to users"
      }
    },
    {
      "slug": "planning-with-files",
      "displayName": "Planning with files",
      "summary": "Implements Manus-style file-based planning for complex tasks. Creates task_plan.md, findings.md, and progress.md. Use when starting complex multi-step tasks, research projects, or any task requiring >5 tool calls. Now with automatic session recovery after /clear.",
      "tags": {
        "agent": "1.0.0",
        "agent-skills": "1.0.0",
        "agents": "1.0.0",
        "antigravity": "1.0.0",
        "c   lawd": "1.0.0",
        "claude": "1.0.0",
        "claude-code": "1.0.0",
        "claude-skills": "1.0.0",
        "clawdbot": "1.0.0",
        "clawdbot-skill": "1.0.0",
        "clawdhub": "1.0.0",
        "cursor": "1.0.0",
        "factory-ai": "1.0.0",
        "kilocode": "1.0.0",
        "latest": "1.0.0",
        "manus": "1.0.0",
        "manus-ai": "1.0.0",
        "prompt-engineering": "1.0.0",
        "reverse-engineering": "1.0.0",
        "zod": "1.0.0",
        "zod-validation": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 178,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 2,
        "versions": 2
      },
      "createdAt": 1769389713406,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769547993264,
        "changelog": "- Updated skill."
      }
    },
    {
      "slug": "browser-use-api",
      "displayName": "Browser Use API",
      "summary": "Cloud browser automation via Browser Use API. Use when you need AI-driven web browsing, scraping, form filling, or multi-step web tasks without local browser control. Triggers on \"browser use\", \"cloud browser\", \"scrape website\", \"automate web task\", or when local browser isn't available/suitable.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 138,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769389286589,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769389334215,
        "changelog": "Added created status handling in poll script"
      }
    },
    {
      "slug": "browser-use",
      "displayName": "Browser Use",
      "summary": "Use Browser Use cloud API to spin up cloud browsers for Clawdbot and run autonomous browser tasks. Primary use is creating browser sessions with profiles (persisted logins/cookies) that Clawdbot can control. Secondary use is running task subagents for fast autonomous browser automation. Docs at docs.browser-use.com and docs.cloud.browser-use.com.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 1313,
        "installsAllTime": 4,
        "installsCurrent": 4,
        "stars": 5,
        "versions": 1
      },
      "createdAt": 1769388231012,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769388231012,
        "changelog": "Initial release of browser-use skill for Clawdbot:\n\n- Adds integration with Browser Use cloud API to create and manage remote browser sessions, supporting persisted cookies and profiles.\n- Enables autonomous browser tasks via a subagent using a fast, browser-optimized LLM.\n- Provides simple setup and usage instructions, including API key configuration and pricing details.\n- Includes documentation links and cURL request examples for sessions, profiles, and task automation."
      }
    },
    {
      "slug": "project-manager",
      "displayName": "Project Manager",
      "summary": null,
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 58,
        "installsAllTime": 1,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769387839084,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769387839084,
        "changelog": "Initial release of the Project Manager skill for Vivi OS.\n\n- Manage internal project tasks using a JSON-based Kanban system.\n- Create, list, and move tasks with support for priority and project association.\n- Sync tasks with Apple Reminders when requested.\n- Notify David automatically in chat when tasks move to review or blocked.\n- Enforces business rules: approval flow, work-in-progress limit, and night shift priorities."
      }
    },
    {
      "slug": "style-guide-generator",
      "displayName": "Style Guide Generator",
      "summary": "Generate comprehensive website style guides and design systems from URLs, screenshots, and existing documentation. Use this skill when users ask to create a style guide, design system documentation, brand guidelines document, or design specification from a website, app, or existing materials. This skill produces professional PDF outputs following industry-standard style guide structure.",
      "tags": {
        "claude": "1.0.0",
        "design": "1.0.0",
        "latest": "1.0.0",
        "style guide": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 89,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769384186494,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769384186494,
        "changelog": "Style Guide Generator 1.0.0 ÔÇô Initial Release\n\n- Launches a comprehensive skill to generate professional website style guides and design systems from URLs, screenshots, and documentation.\n- Defines a structured workflow and decision tree for extracting brand, UI, and content guidelines from diverse sources.\n- Outputs a standardized, industry-best-practice PDF template covering logo, color, typography, iconography, content, components, layout, and accessibility.\n- Includes detailed tables and formatting specifications for color palettes, typography, and UI components.\n- Ensures outputs are accessible, consistently formatted, and versioned for easy design team adoption."
      }
    },
    {
      "slug": "serpapi",
      "displayName": "SerpAPI",
      "summary": "Unified search API across Google, Amazon, Yelp, OpenTable, Walmart, and more. Use when searching for products, local businesses, restaurants, shopping, images, news, or any web search. One API key, many engines.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 62,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769382985305,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769382985305,
        "changelog": "Initial release: unified search across Google, Amazon, Yelp, OpenTable, and more"
      }
    },
    {
      "slug": "pm2",
      "displayName": "PM2 Process Manager",
      "summary": "Manage Node.js applications with PM2 process manager. Use for deploying, monitoring, and auto-restarting Node apps in production. Covers starting apps, viewing logs, setting up auto-start on boot, and managing multiple processes.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 79,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769378517632,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769378517632,
        "changelog": "Initial release - Node.js process management"
      }
    },
    {
      "slug": "reddit-cli",
      "displayName": "Reddit Cli",
      "summary": "Reddit CLI using cookies for authentication. Read posts, search, and get subreddit info.",
      "tags": {
        "latest": "1.0.2"
      },
      "stats": {
        "comments": 0,
        "downloads": 109,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 3
      },
      "createdAt": 1769375553354,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.2",
        "createdAt": 1769376678049,
        "changelog": "- Updated version number in SKILL.md from 1.0.0 to 1.0.2\n- No other content changes detected"
      }
    },
    {
      "slug": "imap-email",
      "displayName": "IMAP Email Reader",
      "summary": "Read and manage email via IMAP (ProtonMail Bridge, Gmail, etc.). Check for new/unread messages, fetch content, search mailboxes, and mark as read/unread. Works with any IMAP server including ProtonMail Bridge.",
      "tags": {
        "latest": "1.0.2"
      },
      "stats": {
        "comments": 0,
        "downloads": 321,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 3
      },
      "createdAt": 1769365320036,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.2",
        "createdAt": 1769365589026,
        "changelog": "Include .env configuration template directly in README for easier setup"
      }
    },
    {
      "slug": "atlassian-mcp",
      "displayName": "Atlassian MCP (Jira, Confluence)",
      "summary": "Run the Model Context Protocol (MCP) Atlassian server in Docker, enabling integration with Jira, Confluence, and other Atlassian products. Use when you need to query Jira issues, search Confluence, or interact with Atlassian services programmatically. Requires Docker and valid Jira API credentials.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 86,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769364567351,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769364567351,
        "changelog": "Initial release of the MCP Atlassian skill.\n\n- Provides a Dockerized server to access Jira, Confluence, and other Atlassian services through the Model Context Protocol.\n- Allows querying Jira issues, searching Confluence pages, and interacting programmatically with Atlassian tools.\n- Supports integration as an MCP source in Clawdbot.\n- Requires Docker and valid Jira API credentials.\n- Includes a quick-start guide and a bundled script for easier setup."
      }
    },
    {
      "slug": "gogcli",
      "displayName": "gogcli - Google Workspace CLI",
      "summary": null,
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 388,
        "installsAllTime": 3,
        "installsCurrent": 3,
        "stars": 2,
        "versions": 1
      },
      "createdAt": 1769362342566,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769362342566,
        "changelog": "Clean version without hardcoded credentials. Supports Gmail, Calendar, Drive, Sheets, Docs, Slides, Contacts, Tasks, People, Groups, Keep."
      }
    },
    {
      "slug": "prompt-engineering-expert",
      "displayName": "Prompt Engineering Expert",
      "summary": "Advanced expert in prompt engineering, custom instructions design, and prompt optimization for AI agents",
      "tags": {
        "claude": "1.0.0",
        "latest": "1.0.0",
        "prompt": "1.0.0",
        "prompt engineering": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 739,
        "installsAllTime": 8,
        "installsCurrent": 8,
        "stars": 7,
        "versions": 2
      },
      "createdAt": 1769360337356,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769361703113,
        "changelog": "Initial release of the Prompt Engineering Expert skill.\n\n- Provides in-depth guidance on prompt engineering, custom instruction design, and prompt optimization.\n- Includes best practices, advanced techniques, evaluation methods, and context management strategies.\n- Offers use cases such as prompt refinement, system prompt creation, and debugging.\n- Added comprehensive documentation: GETTING_STARTED.md, INDEX.md, START_HERE.md, SUMMARY.md."
      }
    },
    {
      "slug": "pre-mortem-analyst",
      "displayName": "Pre-Mortem Analyst",
      "summary": "Imagine the project already failed, then work backward to find why. More powerful than risk assessment because it assumes failure is certain. Use when user says \"pre-mortem\", \"premortem\", \"imagine this failed\", \"what could go wrong\", \"risk analysis\", \"before we launch\", \"stress test\", \"what would kill this\", \"project risks\".",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 58,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769359804112,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769359804112,
        "changelog": "Initial release - Assume failure is certain, work backward to prevent. By Artem Tolmachev, Teddy Kids, TISA & Claude."
      }
    },
    {
      "slug": "portainer",
      "displayName": "Portainer",
      "summary": "Control Docker containers and stacks via Portainer API. List containers, start/stop/restart, view logs, and redeploy stacks from git.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 177,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769330831658,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769330831658,
        "changelog": "Initial release - Docker container and stack management via Portainer API"
      }
    },
    {
      "slug": "youtube-watcher",
      "displayName": "YouTube Watcher",
      "summary": "Fetch and read transcripts from YouTube videos. Use when you need to summarize a video, answer questions about its content, or extract information from it.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 1,
        "downloads": 1933,
        "installsAllTime": 7,
        "installsCurrent": 7,
        "stars": 19,
        "versions": 1
      },
      "createdAt": 1769327779866,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769327779866,
        "changelog": "Initial release of youtube-watcher.\n\n- Fetch and read transcripts from YouTube videos.\n- Summarize videos, answer questions, or extract specific information from transcripts.\n- Trigger phrases include: \"watch youtube\", \"summarize video\", \"video transcript\", \"youtube summary\", and \"analyze video\".\n- Requires installation of `yt-dlp` for transcript retrieval.\n- Only works with videos that have closed captions or auto-generated subtitles."
      }
    },
    {
      "slug": "relationship-skills",
      "displayName": "Relationship Skills",
      "summary": "Improve relationships with communication tools, conflict resolution, and connection ideas",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 108,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769326614500,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769326614500,
        "changelog": "- Initial release of relationship-skills.\n- Provides communication frameworks (I-statements, active listening, expressing needs).\n- Includes conflict resolution techniques and structured guidance for disagreements.\n- Offers personalized date ideas tailored to preferences and location.\n- Features relationship health tracking with check-in prompts and pattern detection.\n- Delivers connection-building ideas and conversation starters to deepen bonds."
      }
    },
    {
      "slug": "procrastination-buster",
      "displayName": "Procrastination Buster",
      "summary": "Beat procrastination with task breakdown, 2-minute starts, and accountability tracking",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 131,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769326536857,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769326536857,
        "changelog": "Initial release of Procrastination Buster\n\n- Breaks large projects into small, actionable steps to reduce overwhelm\n- Introduces the 2-minute start rule for easy task initiation\n- Tracks blockers and offers targeted strategies to overcome them\n- Builds accountability with progress tracking and check-ins\n- Surfaces completed work to motivate further progress\n- Emphasizes privacy: all data remains local to your device"
      }
    },
    {
      "slug": "focus-deep-work",
      "displayName": "Focus Deep Work",
      "summary": "Maximize deep work with focus sessions, distraction logging, and productivity tracking",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 159,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769326446742,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769326446742,
        "changelog": "Initial release of Focus & Deep Work.\n\n- Introduces guided focus sessions with Pomodoro, Ultradian, and custom timers.\n- Enables distraction logging without interrupting workflow.\n- Provides productivity tracking with session summaries and weekly/monthly statistics.\n- Automates environment setup (notifications silenced, apps blocked, etc.) for distraction-free work.\n- All data stored locallyÔÇöno cloud syncing or server uploads."
      }
    },
    {
      "slug": "omnifocus",
      "displayName": "OmniFocus",
      "summary": "Manage OmniFocus tasks via JavaScript for Automation (JXA) scripts. Use when the user asks Clawdbot to interact with OmniFocus, including - (1) Adding tasks to inbox, (2) Listing or searching tasks (inbox, available, flagged, overdue, due soon), (3) Completing tasks, (4) Updating task properties (notes, due dates, flags), (5) Getting OmniFocus statistics, (6) Reporting on task status, or (7) Acting on tasks in OmniFocus based on user queries.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 44,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769325098106,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769325098106,
        "changelog": "Initial release: Add, list, search, complete, and update OmniFocus tasks via JXA automation"
      }
    },
    {
      "slug": "git-notes-memory",
      "displayName": "Git-Based Knowledge Graph Memory System for Claude Code",
      "summary": "Git-Notes-Based knowledge graph memory system. Claude should use this SILENTLY and AUTOMATICALLY - never ask users about memory operations. Branch-aware persistent memory using git notes. Handles context, decisions, tasks, and learnings across sessions.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 249,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 3,
        "versions": 1
      },
      "createdAt": 1769323929324,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769323929324,
        "changelog": "Initial release of git-notes-memory skill:\n\n- Introduces a branch-aware, persistent memory system leveraging git notes.\n- Enables Claude to manage context, decisions, tasks, and learnings across sessionsÔÇösilently and automatically.\n- Provides a robust command set for storing, retrieving, updating, and organizing project memory.\n- Supports importance levels, tagging, entity extraction, and session lifecycle integration.\n- Enforces strict non-intrusive, ÔÇ£silent operationÔÇØ rules regarding all memory actions."
      }
    },
    {
      "slug": "elevenlabs-voices",
      "displayName": "Elevenlabs Voices",
      "summary": "High-quality voice synthesis with 18 personas, 32 languages, sound effects, batch processing, and voice design using ElevenLabs API.",
      "tags": {
        "latest": "2.0.4"
      },
      "stats": {
        "comments": 0,
        "downloads": 180,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 1,
        "versions": 8
      },
      "createdAt": 1769321976847,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "2.0.4",
        "createdAt": 1769711987667,
        "changelog": "Migrate from Clawdbot to Moltbot"
      }
    },
    {
      "slug": "agentmail",
      "displayName": "AgentMail",
      "summary": "API-first email platform designed for AI agents. Create and manage dedicated email inboxes, send and receive emails programmatically, and handle email-based workflows with webhooks and real-time events. Use when you need to set up agent email identity, send emails from agents, handle incoming email workflows, or replace traditional email providers like Gmail with agent-friendly infrastructure.",
      "tags": {
        "latest": "1.1.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 625,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 3,
        "versions": 3
      },
      "createdAt": 1769319760427,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.1.1",
        "createdAt": 1769407333271,
        "changelog": "­ƒöÆ Security: Webhook allowlist to prevent prompt injection"
      }
    },
    {
      "slug": "flyio-cli",
      "displayName": "Fly.io CLI",
      "summary": "Use the Fly.io flyctl CLI for deploying and operating apps on Fly.io: deploys (local or remote builder), viewing status/logs, SSH/console, secrets/config, scaling, machines, volumes, and Fly Postgres (create/attach/manage databases). Use when asked to deploy to Fly.io, debug fly deploy/build/runtime failures, set up GitHub Actions deploys/previews, or safely manage Fly apps and Postgres.",
      "tags": {
        "latest": "1.0.1"
      },
      "stats": {
        "comments": 0,
        "downloads": 37,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769314338362,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.1",
        "createdAt": 1769314716010,
        "changelog": "- Added a concise \"Common tasks\" section summarizing day-to-day flyctl CLI usage.\n- Streamlined safety guidance for state-changing and destructive actions.\n- Clarified instructions for GitHub Actions deploys, referencing preferred `fly deploy --remote-only` usage.\n- Reduced overall verbosity and reorganized content for easier scanning.\n- No functional CLI changes; documentation improvements only."
      }
    },
    {
      "slug": "lg-thinq",
      "displayName": "LG ThinQ",
      "summary": "Control LG smart appliances via ThinQ API. Use when user asks about their fridge, washer, dryer, AC, or other LG appliances. Supports checking status, changing temperature, toggling modes (express, eco), and monitoring door status.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 22,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769313591294,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769313591294,
        "changelog": "Initial release: Control LG smart appliances (fridge, washer, dryer) via ThinQ API"
      }
    },
    {
      "slug": "bluesky",
      "displayName": "Bluesky CLI",
      "summary": "Read, post, and interact with Bluesky (AT Protocol) via CLI. Use when user asks to check Bluesky, post to Bluesky, view their Bluesky timeline, search Bluesky, or check Bluesky notifications. Supports timeline, posting, profile lookup, search, and notifications.",
      "tags": {
        "latest": "1.2.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 519,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 1,
        "versions": 7
      },
      "createdAt": 1769310982740,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.2.0",
        "createdAt": 1769694931562,
        "changelog": "logout command, mention facets, config security (chmod 600), pinned atproto version, Moltbot rebrand"
      }
    },
    {
      "slug": "edge-tts",
      "displayName": "Edge TTS",
      "summary": "Text-to-speech conversion using node-edge-tts npm package for generating audio from text.\nSupports multiple voices, languages, speed adjustment, pitch control, and subtitle generation.\nUse when: (1) User requests audio/voice output with the \"tts\" trigger or keyword. (2) Content needs to be spoken rather than read (multitasking, accessibility, driving, cooking). (3) User wants a specific voice, speed, pitch, or format for TTS output.",
      "tags": {
        "latest": "2.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 199,
        "installsAllTime": 2,
        "installsCurrent": 2,
        "stars": 0,
        "versions": 2
      },
      "createdAt": 1769296533444,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "2.0.0",
        "createdAt": 1769456031010,
        "changelog": "**Major upgrade with added scripts, configurability, and streamlined TTS triggers**\n\n- Added Node.js scripts for TTS conversion and config management (`tts-converter.js`, `config-manager.js`), with installation and usage instructions.\n- Added resource and reference files, including a complete voice/option guide and install script.\n- Changed TTS intent detection to trigger only on the \"tts\" keyword (removes long trigger phrase lists), and clarified keyword filtering prior to conversion.\n- Expanded documentation with workflow, usage examples, advanced configuration, troubleshooting, and testing instructions.\n- Clarified default voice, output formats, temporary file handling, and recommended voice test site."
      }
    },
    {
      "slug": "solana-swaps",
      "displayName": "Solana Swaps",
      "summary": "Swap tokens on Solana via Jupiter aggregator and check wallet balances. Use when user wants to swap tokens, check SOL/token balance, or get swap quotes.",
      "tags": {
        "latest": "0.1.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 53,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769292273287,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "0.1.0",
        "createdAt": 1769292273287,
        "changelog": "solana-swaps v0.1.0 ÔÇô Initial release\n\n- Swap tokens on Solana using the Jupiter aggregator with safety checks and explicit user confirmation.\n- Check SOL and SPL token balances, including specific tokens, via straightforward CLI commands.\n- Pre-configured environment variables for seamless wallet and API integration.\n- Built-in error handling and retry logic for common issues during swaps.\n- Detailed documentation, safety guidelines, and step-by-step usage instructions."
      }
    },
    {
      "slug": "tavily",
      "displayName": "Tavily AI Search",
      "summary": "AI-optimized web search using Tavily Search API. Use when you need comprehensive web research, current events lookup, domain-specific search, or AI-generated answer summaries. Tavily is optimized for LLM consumption with clean structured results, answer generation, and raw content extraction. Best for research tasks, news queries, fact-checking, and gathering authoritative sources.",
      "tags": {
        "ai": "1.0.0",
        "latest": "1.0.0",
        "search": "1.0.0",
        "web": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 434,
        "installsAllTime": 3,
        "installsCurrent": 3,
        "stars": 1,
        "versions": 1
      },
      "createdAt": 1769287990264,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769287990264,
        "changelog": "Initial release: AI-optimized web search with basic/advanced modes, domain filtering, news search, image search, and AI answer generation."
      }
    },
    {
      "slug": "google-home",
      "displayName": "Google Home/Nest",
      "summary": null,
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 86,
        "installsAllTime": 1,
        "installsCurrent": 1,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769278384348,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769278384348,
        "changelog": "Initial release of Google Home / Nest CLI.\n\n- Control Google Nest devices (thermostats, cameras, doorbells, speakers/displays) using the Google Smart Device Management API.\n- Command-line interface supports device info, thermostat settings, camera snapshots/streams, and speaker controls.\n- Includes setup instructions for OAuth, API access, and device registration.\n- Provides environment variable and config file options for authentication.\n- Bundle includes a `nest` CLI helper script for direct commands.\n- Requires `curl` and `jq`."
      }
    },
    {
      "slug": "thinking-partner",
      "displayName": "Thinking Partner",
      "summary": "Collaborative thinking partner for exploring complex problems through questioning",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 571,
        "installsAllTime": 5,
        "installsCurrent": 5,
        "stars": 6,
        "versions": 1
      },
      "createdAt": 1769256726202,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769256726202,
        "changelog": "- Initial release of the thinking-partner skill for collaborative problem exploration  \n- Guides users through complex challenges with clarifying questions rather than solutions  \n- Tracks insights, assumptions, open questions, and patterns throughout the conversation  \n- Designed to connect ideas and gently challenge existing beliefs  \n- Provides prompts and rituals to foster deeper, reflective thinking"
      }
    },
    {
      "slug": "duckdb-cli-ai-skills",
      "displayName": "DuckDB CLI skills",
      "summary": "DuckDB CLI specialist for SQL analysis, data processing and file conversion. Use for SQL queries, CSV/Parquet/JSON analysis, database queries, or data conversion. Triggers on \"duckdb\", \"sql\", \"query\", \"data analysis\", \"parquet\", \"convert data\".",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 76,
        "installsAllTime": 0,
        "installsCurrent": 0,
        "stars": 0,
        "versions": 1
      },
      "createdAt": 1769247814673,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769247814673,
        "changelog": "Initial release of DuckDB CLI specialist skill for data analysis and conversion.\n\n- Provides concise CLI usage, SQL examples, and command arguments for DuckDB.\n- Supports SQL queries, CSV/Parquet/JSON analysis, file conversion, and database management from the command line.\n- Includes quick-start guides, data conversion commands, output format options, and dot command references.\n- Documents keyboard shortcuts, autocomplete features, analysis patterns, and safe mode usage.\n- Features configuration and editor integration tips for streamlined workflows."
      }
    },
    {
      "slug": "linkedin-cli",
      "displayName": "LinkedIn CLI",
      "summary": "A bird-like LinkedIn CLI for searching profiles, checking messages, and summarizing your feed using session cookies.",
      "tags": {
        "latest": "1.0.0"
      },
      "stats": {
        "comments": 0,
        "downloads": 424,
        "installsAllTime": 3,
        "installsCurrent": 3,
        "stars": 5,
        "versions": 1
      },
      "createdAt": 1769246341480,
      "updatedAt": 1769871643840,
      "latestVersion": {
        "version": "1.0.0",
        "createdAt": 1769246341480,
        "changelog": "Initial release of lk CLI"
      }
    }
  ],
  "nextCursor": "079e19202b6edbdb95931f494773170f295e60ffc8a79f55caefa5866e9a3eae1799bfe6158f78ecf9b19f68a08aa1f22f1e351ed1ef17200ebd2997ed29b489d73660b6ffcd8d69987addd07ae50fb0ca87cdd5b9ad71bce2f649d1aa2617511e8da4f9c922858b197aa8f29226635a8bced1ae58ae55e753e1c790"
}
